{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"rxjs. angular 2\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/reasons-to-use-rxjs-today/",
            "url": "http://davembush.github.com/reasons-to-use-rxjs-today/",
            "title": "Reasons to use RxJS Today",
            "date_published": "2016-12-13T12:30:00.000Z",
            "content_html": "<p>If you’ve started looking at Angular 2, one of the things that you’ll notice is that <a href=\"//github.com/Reactive-Extensions/RxJS\">RxJS</a> has gotten a bit of a toe hold in the framework. This becomes apparent the first time you try to access data. Gone is the $http service that returns a promise. Instead, we now have a service that returns an Observable. Now, writing the code to access the server is arguably easy to learn. But, as you travel down the rabbit hole that is Angular 2, you realize that RxJS shows up in places as disperse as <a href=\"//github.com/ngrx/store\">NgRX&#x2F;Store</a>, handling events, and as we’ve already mentioned, AJAX calls.</p>\n<p>Because it shows up in so many places, this new API is set to be the next thing we will need to learn to be effective JavaScript programmers. But, should we?</p>\n<figure>![](/uploads/2016/12/image.png \"Reasons to use RxJS Today\")<figcaption>Photo credit: [Dace Kiršpile](//www.flickr.com/photos/91035846@N05/9374805577/) via [Visualhunt](//visualhunt.com) / [CC BY](//creativecommons.org/licenses/by/2.0/)</figcaption></figure>\n\n<span id=\"more\"></span>\n\n<h2 id=\"A-Story\"><a href=\"#A-Story\" class=\"headerlink\" title=\"A Story\"></a>A Story</h2><p>As I first started to dig into using RxJS, I found myself being more confused than I expected. And yet, I was convinced that this new way of thinking about my code would be well worth the effort.</p>\n<p>It reminds me of the days when we switched from Procedural Programming (PP) to Object Oriented Programming (OOP). Yes, I’ve been coding that long.</p>\n<p>Somewhere around the third year of my career, C++ finally became popular enough that both Borland and Microsoft produced a C++ compiler and framework for developing Windows applications. I remember falling in love with it. Maybe I hadn’t been using procedural programming long enough to make switching difficult. Maybe I just thought about code as Objects anyhow. But, whatever the reason, I couldn’t figure out why some of my peers had such a hard time grasping the concepts.</p>\n<p>As I was working on learning RxJS, I found myself feeling like I was either too old to learn a new trick, or I was just getting dumb in my old age. Why is it so hard? Fortunately, I found a site that helped me understand RxJS specifically and Reactive Functional programming in general. I am no longer in the class of “old farts who can’t learn new stuff.” And now that I understand, everything is starting to look for Reactive.</p>\n<h2 id=\"What-Is-RxJS\"><a href=\"#What-Is-RxJS\" class=\"headerlink\" title=\"What Is RxJS?\"></a>What Is RxJS?</h2><p>If you’ve ready anything about RxJS or any of the ReactiveX libraries that are available for other languages, you’ll find that most of them start off by saying that RxJS “makes everything a stream.” Which, while that may be technically true, isn’t very helpful. What would it look like if we redefine that? The best way to think about RxJS is that it makes everything a special type of collection called an Observable.</p>\n<h3 id=\"Arrays\"><a href=\"#Arrays\" class=\"headerlink\" title=\"Arrays\"></a>Arrays</h3><p>In JavaScript, you are already deal with a special type of collection called an Array.</p>\n<p>Now, let me lead you though the thought process you’ll need to travel down to see how RxJS is going to be helpful for you.</p>\n<p>For now, let’s just assume everything is an array. This will make the jump easier.</p>\n<p>In pure JavaScript, you are typically writing code that either looks like this: (old school)</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> someArray = [...data here...];</span><br><span class=\"line\"><span class=\"keyword\">for</span>(<span class=\"keyword\">var</span> i = <span class=\"number\">0</span>;i &lt; array.<span class=\"property\">length</span>;i++) &#123;</span><br><span class=\"line\">    <span class=\"keyword\">var</span> a = someArray[i];</span><br><span class=\"line\">   ... <span class=\"keyword\">do</span> something <span class=\"keyword\">with</span> the data ...</span><br><span class=\"line\">&#125;</span><br></pre></td></tr></table></figure>\n\n<p>Or using newer syntax:</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> someArray = [...data here...];</span><br><span class=\"line\">someArray.<span class=\"title function_\">forEach</span>(<span class=\"keyword\">function</span>(<span class=\"params\">a</span>) &#123;</span><br><span class=\"line\"> ...<span class=\"keyword\">do</span> something <span class=\"keyword\">with</span> the data...</span><br><span class=\"line\">&#125;);</span><br></pre></td></tr></table></figure>\n\n<p><a href=\"//code.tutsplus.com/tutorials/what-they-didnt-tell-you-about-es5s-array-extras--net-28263\">Array Extras</a> takes some of the code we typically write in these loops and standardizes them so we can reduce the amount of code we need to write, while still achieving the same goals.</p>\n<p>For example, you might loop through an array to generate a new array. For that you would use map(). Or you might loop through an array to filter out elements. That would be filter().</p>\n<p>The great thing about this Array Extra functions is that they each return a new array. This means you don’t impact the original array and you can chain these functions together:</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br><span class=\"line\">12</span><br><span class=\"line\">13</span><br><span class=\"line\">14</span><br><span class=\"line\">15</span><br><span class=\"line\">16</span><br><span class=\"line\">17</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> someArray = [...data here...];</span><br><span class=\"line\"><span class=\"keyword\">var</span> transformedAndFiltered = someArray</span><br><span class=\"line\">   .<span class=\"title function_\">filter</span>(<span class=\"keyword\">function</span>(<span class=\"params\">item</span>)&#123;...filter code...&#125;)</span><br><span class=\"line\">   .<span class=\"title function_\">map</span>(<span class=\"keyword\">function</span>(<span class=\"params\">item</span>)&#123;...tranform code...&#125;);</span><br><span class=\"line\"><span class=\"string\">``</span><span class=\"string\">` javascript</span></span><br><span class=\"line\"><span class=\"string\"></span></span><br><span class=\"line\"><span class=\"string\">`</span>someArray<span class=\"string\">` still has the original data and transformedAndFiltered has the new data.</span></span><br><span class=\"line\"><span class=\"string\"></span></span><br><span class=\"line\"><span class=\"string\">### Events</span></span><br><span class=\"line\"><span class=\"string\"></span></span><br><span class=\"line\"><span class=\"string\">Now, imagine we create a system where we have arrays that never end. Instead of using the old school for/next loop, we would be left with only being able to use a forEach, or one of the Array Extras function. Which would be fine. The function would just wait until the next element showed up or it got some sort of signal that there wouldn’t be any more elements.</span></span><br><span class=\"line\"><span class=\"string\"></span></span><br><span class=\"line\"><span class=\"string\">This is exactly what RxJS does. So, now we can listen for events as though they were arrays.</span></span><br><span class=\"line\"><span class=\"string\"></span></span><br><span class=\"line\"><span class=\"string\">`</span><span class=\"string\">``</span> javascript</span><br><span class=\"line\"><span class=\"title class_\">Observable</span>.<span class=\"title function_\">fromEvent</span>(element,<span class=\"string\">&#x27;click&#x27;</span>)</span><br><span class=\"line\">   .<span class=\"title function_\">subscribe</span>(<span class=\"keyword\">function</span>(<span class=\"params\">x</span>)&#123;...<span class=\"keyword\">do</span> something <span class=\"keyword\">in</span> response...&#125;);</span><br></pre></td></tr></table></figure>\n\n<p>Pretty cool, right? If you need to, you can place a filter prior to the subscribe so that you only get events that meet the exact condition. In fact, if any of the functions you pass as parameters have conditional logic in them, this is a good indication that you are not yet thinking in a Reactive way.</p>\n<h3 id=\"Asynchronous-Code\"><a href=\"#Asynchronous-Code\" class=\"headerlink\" title=\"Asynchronous Code\"></a>Asynchronous Code</h3><p>Now, as I’ve already mentioned, RxJS also lets you deal with asynchronous code as though it is an array. This works pretty much as you would expect on the surface, but there are some added advantages to using RxJS to deal with asynchronous calls. The most significant of them being that you can achieve better flow of control.</p>\n<p>If you’ve ever dealt with needing to make multiple calls to the server for data prior to allowing the user to use the screen, you’ll appreciate that you can make all the calls at once and only continue once all of them have completed. Or, you could make the calls one after the other, if you have calls that depend on each other. Yes, promises do this as well, but the Reactive method is a bit cleaner.</p>\n<p>The other way RxJS improves on promises is that you can cancel a request instead of just letting it run even though you no longer want the data. This means, you won’t be tying up bandwidth waiting for data to come back when you want newer data instead.</p>\n<p>Finally, using RxJS, you can easily retry a failing request, as well as deal with failing request using the .retry() and catch() functions.</p>\n<h2 id=\"Functional-Matters\"><a href=\"#Functional-Matters\" class=\"headerlink\" title=\"Functional Matters\"></a>Functional Matters</h2><p>Now, all of this is great. But the side effect of the fact that RxJS is both Functional and Reactive is that it not only reduces the amount of code that you need to write, but it also produces code that is less prone to errors and easier to test.</p>\n<p>Let me explain.</p>\n<p>We’ve already shown above that all the RxJS functions return new Observables. I kind of brushed over this. But this is a big deal. Because the original data in the Observable is never modified, you never run the risk of modifying the data that some other part of your code is expecting to never be modified. This is even more important when you are working on a larger project with multiple developers. This means all your assumptions about your data will remain true when your team commits to using functional paradigms throughout your code base.</p>\n<p>But this effect doesn’t just impact the observable code base. What I’ve found is that the more code you write that is functional and obeys the immutable rules, the easier the rest of your code is to test. Specifically, I find myself using less dependency injection simply because I am using immutable objects. Because I can depend on the code not having any side effects, my functional code is easier to test and my none functional, more object-oriented code, is easier to test because it has fewer dependencies.</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>The most difficult thing about using RxJS or any other Reactive Functional library is the fact that it requires you to think a little bit differently about the problems you are solving. But the advantages far outweigh the learning curve. Don’t be like so many of the script kiddies on the web who complain every time they must learn something new. Step up to the challenge. Your customers will thank you. The guy who maintains your code in the future will thank you. Your future self will thank you.</p>\n",
            "tags": [
                "javascript",
                "rxjs. angular 2"
            ]
        }
    ]
}