{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"node\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/you-can-start-using-node-today/",
            "url": "http://davembush.github.com/you-can-start-using-node-today/",
            "title": "You Can Start Using Node Today",
            "date_published": "2016-08-02T10:30:00.000Z",
            "content_html": "<p>I was just getting started writing an article about using Node&#x2F;JavaScript to drive my Selenium tests and as I was writing the “Prerequisite” section, I realized I have never written the basics about how to get setup with Node or even why you would want to.</p>\n<p>As popular as Node is, I am still finding that many of the people I work with have no idea what it is or if they do, they only have a partial idea and can’t see how it would apply to the work they do on a daily basis.</p>\n<p>So, let’s start with the fundamentals.</p>\n<figure>![](/uploads/2016/07/image-4.png \"You Can Start Using Node Today\")<figcaption>Photo credit: [stevendepolo](//www.flickr.com/photos/stevendepolo/5749192025/) via [VisualHunt.com](//visualhunt.com) / [CC BY](//creativecommons.org/licenses/by/2.0/)</figcaption></figure>\n\n<span id=\"more\"></span>\n\n<h2 id=\"What-is-Node\"><a href=\"#What-is-Node\" class=\"headerlink\" title=\"What is Node?\"></a>What is Node?</h2><p>I think the best place to start with our introduction is by providing a comprehensive view of what Node is.  A rather simplistic description would be, “Node is the V8 JavaScript engine from the Chrome browser, wrapped in an executable, that lets you run JavaScript without a browser.” Now, with that simplistic definition, you might think, “Why would I want to do that?”  Maybe you are assuming that this implementation only lets you do the same stuff that you can do in the browser.  And this is where you would be wrong.</p>\n<p>So, let’s start over.</p>\n<p>Node allows you to write cross platform applications that will run directly on your computer using JavaScript as the language.</p>\n<p>And now I hear everyone thinking, “Yeah, yeah, that was the promise of Java.” OK.  Maybe that’s true.  Time will tell.</p>\n<h2 id=\"What-Can-You-Do-with-Node\"><a href=\"#What-Can-You-Do-with-Node\" class=\"headerlink\" title=\"What Can You Do with Node?\"></a>What Can You Do with Node?</h2><p>Several well-known applications use Node.  You may be surprised at how much node is already being used.  Here’s a short list:</p>\n<ul>\n<li>Many Web Servers</li>\n<li>Desktop Applications</li>\n<li>Developer Build Processes</li>\n</ul>\n<p>Does any of that surprise you? There is a <a href=\"//github.com/nodejs/node/wiki/Projects,-Applications,-and-Companies-Using-Node\">long list of companies</a> who are using Node for some part of their development process or infrastructure.  Some more notable implementations include:</p>\n<ul>\n<li>VS Code by Microsoft – a code editor built using Node and Electron.</li>\n<li>Slack Desktop App – uses Node and Electron</li>\n</ul>\n<p>In short, you can do just about anything you can think of.</p>\n<h2 id=\"Installing-Node\"><a href=\"#Installing-Node\" class=\"headerlink\" title=\"Installing Node\"></a>Installing Node</h2><p>This falls under the category of “Things I wish I had known.” You can just go to the <a href=\"//nodejs.org/en/\">Node site</a> and download the version you want to use.  But at some point, you are going to want to use multiple versions of Node.  One version for one project and a different version for some other project.  For that, you are going to need a tool called ‘NVM’.  Life will be a lot easier if you just install NVM first and then install Node from there.</p>\n<p>If you are running Windows, you’ll want to <a href=\"//github.com/coreybutler/nvm-windows/releases\">grab NVM from here</a>.  Everyone else can <a href=\"//github.com/creationix/nvm\">get NVM from here</a>. Once you have NVM installed, you should be able to run <code>nvm install _version.number.here_</code> or you can run <code>nvm install node</code> To install the latest version.</p>\n<p>You can run this command for each version you want to have installed.</p>\n<p>To see which versions are installed, you can run <code>nvm ls</code> And to use a specific version you can run <code>nvm use _version.number.here_</code></p>\n<h2 id=\"Using-the-Node-Package-Manager\"><a href=\"#Using-the-Node-Package-Manager\" class=\"headerlink\" title=\"Using the Node Package Manager\"></a>Using the Node Package Manager</h2><p>When you installed Node, you also installed the Node Package Manager(NPM).  For those of you who are coming from the Microsoft world, NPM is like NuGet.  It is how we install additional “Modules” (think libraries) into our Node environment.</p>\n<p>The commands for NPM are pretty straight forward and most of the time, the documentation will tell you exactly what command to run to get it into your development environment.  But, it is helpful to know why you are running the various commands.</p>\n<p>But, before you start installing Node packages into your development environment, you are going to want a package.json file.  The easiest way to create this in a form that NPM can use is to use the command <code>npm init</code> which will walk you through all of the questions you need to answer to create a proper package.json file.</p>\n<p>The next command you are going to encounter is <code>npm install</code>.</p>\n<p>But <code>npm install</code> has several switches that you’ll be using.  Each with a different purpose.</p>\n<p><code>npm install _packagename_</code></p>\n<p>This will install the most recent version of the package into your node_modules directory and record the dependency in your package.json file in the dependencies section.</p>\n<p>If you want to be explicit about where you are saving the file you can use the <code>--save</code> flag.  It does the same thing as <code>npm install package</code>.</p>\n<p><code>npm install --save _packagename_</code></p>\n<p>Your other option for saving is</p>\n<p><code>--save-dev</code>.</p>\n<p>This puts the dependency in the devDependencies section.</p>\n<p>You might wonder why you would have two different dependency sections.</p>\n<p>The reason for this is because you might have modules that you need simply to build the project. They aren’t needed when you deploy the project. So having the two different sections allows you to deploy without the extra set of modules.</p>\n<h2 id=\"Node-JavaScript\"><a href=\"#Node-JavaScript\" class=\"headerlink\" title=\"Node JavaScript\"></a>Node JavaScript</h2><p>I once had someone assert that even within the same versions of JavaScript, there are different versions of JavaScript.  His main point was that there are differences between JavaScript on the browser and JavaScript in Node.  I assert, they are the same version of JavaScript, but the API that is available, or required, is different based on the environment.</p>\n<p>So, JavaScript on Node is syntactically no different from the JavaScript you write now.  However, Node does solve an age old problem we’ve had in client side code automatically. This problem is global scope pollution. If we write JavaScript that looks like this:</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> a = <span class=\"string\">&#x27;abc&#x27;</span>;</span><br></pre></td></tr></table></figure>\n\n<p>Without wrapping the code in a function, the code will end up in global scope.</p>\n<p>The fix for this is to wrap all of our files in immediately invoked function expressions (IIFEs).  I’ve written about using IIFEs before as a best practice for Angular programming.  In fact, it is a best practice for all client side JavaScript programming.</p>\n<p>But, in Node it is completely unnecessary because Node puts each file in its own scope.  Putting something on the global scope is something you have to do intentionally.  This is good, but it does require us to write some extra code.</p>\n<p>You see, the problem is, if all of the code we write is only local to the file we write it in, how are we going to be able to write code in a modular fashion?  We don’t want all of our code in one monolithic file.</p>\n<h2 id=\"Modules\"><a href=\"#Modules\" class=\"headerlink\" title=\"Modules\"></a>Modules</h2><p>So, to handle this problem, Node implements two keywords&#x2F;functions&#x2F;variables (depends on how you think about it) We’ll just call them keywords for now.</p>\n<p>The first is the requires() keyword.</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> foo = <span class=\"built_in\">require</span>(<span class=\"string\">&#x27;fooScript&#x27;</span>);</span><br></pre></td></tr></table></figure>\n\n<p>This says go find the script “fooScript.js” and assign what was exported from it to our “foo” variable.  If the file you need to require has been installed with NPM, then all you need is the name of the module, like I did above.  But if you are requiring in a file from your own code, you’ll need to require using a path reference.  For you Windows people, this always works using forward slashes (&#x2F;) not backslash (\\).</p>\n<p>This probably leaves you asking the question, how does fooScript expose its content to the module requiring it? With code that looks like this:</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"variable language_\">module</span>.<span class=\"property\">exports</span> = fooFunc;</span><br></pre></td></tr></table></figure>\n\n<p>This line normally appears at the end of a file.  In the case of the line above, assume that fooFunc is a function that is defined somewhere above the module.exports line. You could also write the exports using:</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"built_in\">exports</span> = fooFunc;</span><br></pre></td></tr></table></figure>\n\n<p>They do the same thing.</p>\n<p>If our fooFunc is in a file named “fooScript.js” then our foo variable above can call the fooFunc() function by using foo.</p>\n<figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">var foo = require(&#x27;fooScript&#x27;);</span><br><span class=\"line\">foo(); // this line calls fooFunc() in fooScript.</span><br></pre></td></tr></table></figure>\n\n<h2 id=\"Optimizations\"><a href=\"#Optimizations\" class=\"headerlink\" title=\"Optimizations\"></a>Optimizations</h2><p>What took me a while to grasp is that you can export anything.  A function, a variable, an object.  It really doesn’t matter.  But you have to be aware of some optimizations that Node makes for you.</p>\n<p>You see, it would be pretty stupid to process the file every time it was required into another file.  So rather than do that, Node caches the export and assigns that the next time it is required.  If you export an object, the next time you require it, you will get the same object.  So an exported object becomes a singleton.  If you want to be able to create new objects, you are better off exporting the function (or class in ES2015) that creates the object and new-ing it up when you need it.</p>\n<h2 id=\"Your-Turn\"><a href=\"#Your-Turn\" class=\"headerlink\" title=\"Your Turn\"></a>Your Turn</h2><p>So, now it is your turn.  If you have not tried using Node.js install it and try a few things.</p>\n",
            "tags": [
                "javascript",
                "node",
                "npm",
                "nvm"
            ]
        },
        {
            "id": "http://davembush.github.com/node-js-tools-for-visual-studio/",
            "url": "http://davembush.github.com/node-js-tools-for-visual-studio/",
            "title": "Node.js Tools For Visual Studio",
            "date_published": "2015-04-02T10:00:00.000Z",
            "content_html": "<p><img src=\"/uploads/2015/03/NodeJsInVisualStudioProjectList.png\" alt=\"NodeJsInVisualStudioProjectList\" title=\"NodeJsInVisualStudioProjectList\"></p>\n<p>Several weeks ago now, I started learning <a href=\"//nodejs.org/\">Node.js</a>.  Why?  Well, for a couple of reasons.  First, all the cool kids are using Node.js.  Second, I wanted to use <a href=\"//gotwarlost.github.io/istanbul/\">Istanbul</a> to get an idea of how well my javascript code is covered by test and that runs under Node.js.  Third, <a href=\"//blogs.msdn.com/b/webdev/archive/2015/03/19/customize-external-web-tools-in-visual-studio-2015.aspx\">Node.js is going to show up in the next version of Visual Studio</a>.  And finally, I just like to learn new stuff.</p>\n<span id=\"more\"></span>\n\n<h2 id=\"Node-JS\"><a href=\"#Node-JS\" class=\"headerlink\" title=\"Node.JS\"></a>Node.JS</h2><p>So, I started by installing node and just working in Visual Studio as though my node project was a web site.  It works, but it isn’t pretty.  But it did get me familiar with some basic concepts like using the node package manager (npm) to install what I needed to get Istanbul running.  For those of you who aren’t familiar with npm, it is basically NuGet for node.js.</p>\n<h2 id=\"Istanbul-JavaScript-Code-Coverage\"><a href=\"#Istanbul-JavaScript-Code-Coverage\" class=\"headerlink\" title=\"Istanbul JavaScript Code Coverage\"></a>Istanbul JavaScript Code Coverage</h2><p>For those of you who are interested, I used the instructions <a href=\"//ariya.ofilabs.com/2013/10/code-coverage-of-jasmine-tests-using-istanbul-and-karma.html\">here</a> for getting Istanbul working locally.  They should probably be updated because the example there doesn’t have a good configuration example.  I filled in the rest of what I needed to know from the <a href=\"//karma-runner.github.io/0.12/\">Karma site</a>.</p>\n<h2 id=\"Node-for-Visual-Studio\"><a href=\"#Node-for-Visual-Studio\" class=\"headerlink\" title=\"Node for Visual Studio\"></a>Node for Visual Studio</h2><p>So then I had heard that work was being done on a plugin for Visual Studio 2013 that would allow me to work on Node projects from within Visual Studio.  I found out about this first from <a href=\"//www.hanselman.com/blog/IntroducingNodejsToolsForVisualStudio.aspx\">Scott Hanselman’s blog</a>.</p>\n<p>So I went  to the <a href=\"//nodejstools.codeplex.com/\">plugin site</a> and got the download and installed it.  This is all pretty straight forward.  Don’t forget, you’ll ALSO need to install node.  So, don’t forget that step.</p>\n<p>OK.  Now that you have the NTVS installed (that’s what they call the plugin) what do you have? Well, you have several new project templates that you can use.  That’s what.</p>\n<p><img src=\"/uploads/2015/03/NodeJsInVisualStudioProjectList1.png\" alt=\"NodeJsInVisualStudioProjectList\" title=\"NodeJsInVisualStudioProjectList\"></p>\n<h2 id=\"Interactive-JavaScript\"><a href=\"#Interactive-JavaScript\" class=\"headerlink\" title=\"Interactive JavaScript\"></a>Interactive JavaScript</h2><p>But that’s not all you get, you also get an interactive Node.js window that you can get to from the Tools menu (Tools –&gt; Node.js Tools –&gt; Node.js Interactive window) or by pressing the keyboard shortcut, Ctrl+K, N.  Inside this window you can execute JavaScript on the fly: <img src=\"/uploads/2015/03/NodeJsInteractiveWindow.png\" alt=\"NodeJsInteractiveWindow\" title=\"NodeJsInteractiveWindow\"></p>\n<h2 id=\"Node-Package-Manager-in-Visual-Studio\"><a href=\"#Node-Package-Manager-in-Visual-Studio\" class=\"headerlink\" title=\"Node Package Manager in Visual Studio\"></a>Node Package Manager in Visual Studio</h2><p>Or install other node packages:</p>\n<p>.npm install yourPackageNameHere</p>\n<p>Don’t forget the leading period.  That’s the indication to the window that it needs to do something different from executing javascript in the window.</p>\n<p>Even as I’m writing this, I’m seeing that there is a lot more here than I’m actually telling you now.</p>\n<h2 id=\"Starting-a-New-Project\"><a href=\"#Starting-a-New-Project\" class=\"headerlink\" title=\"Starting a New Project\"></a>Starting a New Project</h2><p>Now, the best way of learning something is by creating some kind of product.  Even if it is for your own use.  So, the next thing I did was to try to create a project.  I have a specific project in mind that should use MongoDB for the database (I’ve been meaning to learn NoSQL for a while now) and since Express seems to come with NTVS, I guess I’ll use that for my web server.  Oh and Angular for the front end.</p>\n<p>Since I was creating a web site, I thought, I should create a new web project that uses node.  In fact, it shows up  in the list of web sites types that you can create.  However, I got an error when I did that, and I don’t see anything in the documentation that says I should be able to use those templates or that I need anything extra to use them.</p>\n<p>However, if you use the project options, you can create a web application.  I decided going with newer is better than older, so I’ve created a “Basic Node.js Express 4 Application”.</p>\n<h2 id=\"The-Fun-Is-Just-Beginning\"><a href=\"#The-Fun-Is-Just-Beginning\" class=\"headerlink\" title=\"The Fun Is Just Beginning\"></a>The Fun Is Just Beginning</h2><p>And now, this is where the fun begins.  Where’s my HTML?  What’s all this “template” stuff?  And how do I install Angular?  Or do I do that manually since it isn’t a server side thing? So much to learn.  But, that’s for another post.</p>\n",
            "tags": [
                "javascript",
                "express",
                "node"
            ]
        },
        {
            "id": "http://davembush.github.com/selenium-grid-setup/",
            "url": "http://davembush.github.com/selenium-grid-setup/",
            "title": "Selenium Grid Setup",
            "date_published": "2015-01-08T12:00:00.000Z",
            "content_html": "<p><img src=\"/uploads/2015/01/SeleniumGridSetup.png\" alt=\"SeleniumGridSetup\" title=\"SeleniumGridSetup\"></p>\n<p>My experience with setting up Selenium Grid was frustrated by the lack of information available about exactly what I needed to do to get this working.</p>\n<p>I’ve actually had this working for a while now and I’ve set it up, or helped others set it up now, several times.  So, I guess it is time to write a post about it so I can just send people here when I need to explain the setup.</p>\n<span id=\"more\"></span>\n\n<p>Note, the following discussion already assumes you know something about how to use Selenium without the Grid so there won’t be a lot of code here other than what is need to get the Grid up and running so you can run your test on it.  First, we need to discuss the basic configuration of a Selenium Grid setup.  There are two main parts.  A Selenium Hub, and Selenium Nodes.  The Hub is what your test code will talk to.  Think of it as the traffic cop to all the browsers you want to test.</p>\n<p>The Selenium Nodes register themselves with the Hub and tell the Hub what browsers they support.</p>\n<p>You will only have one Hub, but you might have multiple nodes.  In my basic configuration, I have two nodes running on the same computer as my Hub that support the current version of FireFox and the current version of IE, since those are the only browsers that are officially supported by the organization I am working at.  (These are private sites, and yes, everyone knows Chrome is better than either of those, but you know how fast policies change in large organizations.) OK, so much for theory, here is how to setup your system.</p>\n<p>First, on the computers that you will be running the Hub and the Nodes on, create a directory to hold all the files you will need. I generally put all of my files in c:\\selenium.  It makes them really easy to find.</p>\n<p>Since the Selenium Grid runs using Java, make sure you have that installed on the computers you need to run the Hub and Nodes on.</p>\n<p>OK.  Enough setup.  Now for the actually Selenium Grid files you are going to need.</p>\n<p>Download the selenium server JAR file.  There is a link to it under the “Selenium Server” section of this page: <a href=\"//www.seleniumhq.org/download/\" title=\"http://www.seleniumhq.org/download/\">http://www.seleniumhq.org/download/</a>.  The current file name is “selenium-server-standalone-2.44.0.jar”.  Place the file in the selenium directories you created.  This is the jar file you will run for both the Hub and the Nodes so you’ll need this on every computer you plan to run the Grid on.</p>\n<p>For the various browsers you want to run on that need a separate driver, like IE, you’ll also want to download and install the appropriate driver server from that same page and place the EXE on the computer that you plan to run that browser on.</p>\n<p>Now to get this running.</p>\n<p>You’ll want to put the following in a cmd file and place the cmd file in the Selenium directory with all the other stuff on your Hub computer:</p>\n<figure class=\"highlight shell\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">&quot;&#123;path to your java directory&#125;\\java.exe&quot; -jar</span><br><span class=\"line\">    selenium-server-standalone-2.44.0.jar -role hub</span><br></pre></td></tr></table></figure>\n\n<p>This will run the Hub on port 4444.  This is all you need to do.  You should end up with a console window that looks like this: <img src=\"/uploads/2015/01/Hub1.png\" alt=\"Hub\" title=\"Hub\"> The next script you will need to create is the script that will run the node.  Since I only need FireFox and IE11, I run this on the same computer.  I’ll first provide you with that script and then explain it so that you can adapt it for your own situation.</p>\n<p>Here’s the script:</p>\n<figure class=\"highlight shell\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">&quot;&#123;path to your java directory&#125;\\java.exe&quot; -jar</span><br><span class=\"line\">    selenium-server-standalone-2.44.0.jar -role</span><br><span class=\"line\">    node -hub http://localhost:4444/grid/register/ -browser</span><br><span class=\"line\">    browserName=firefox,maxInstances=5,platform=WINDOWS -browser</span><br><span class=\"line\">    browserName=&quot;internet explorer&quot;,version=11,maxInstances=5,</span><br><span class=\"line\">    platform=WINDOWS,</span><br><span class=\"line\">    -Dwebdriver.ie.driver=c:\\Selenium\\IEDriverServer.exe</span><br></pre></td></tr></table></figure>\n\n<p>The first thing you should note is that we’ve specified the role as “node” with the –role node flag.</p>\n<p>Since we are a Node, we also have to tell the node where the Hub is so that it can register itself with the Hub.  That is what the –hub <a href=\"http://localhost:4444/grid/register/\">http://localhost:4444/grid/register/</a> parameter is for.  If you are placing a node on a computer other than the same computer as the Hub, you will obviously need to change the  URL to point back to the Hub computer instead  of localhost.</p>\n<p>Everything past this point tells the Hub what browsers are supported on this Node.  So, you’ll notice we have two –browser parameters.  One for FireFox and one for IE.  The browser parameter is all one long string.  To specify IE, you’ll want to specify “internet explorer”.  Note the quote marks and the space.  It took me a while to figure this part out.  The next browser parameter is maxInstances and it tells the Hub how many instances of the browser can run on this node.  I hardly ever have more than one running at a time, but specifying 5 allows me to run test even if something goes wrong.  If something does go wrong, the instance will eventually close itself.</p>\n<p>The next parameter, platform, tells the Hub what platform we are running on.  You may not need  this if all of your platforms are the same.  But if you are running FireFox on Mac, Windows, and Linux, you’ll want to specify this.</p>\n<p>Since I only ever test the most recent version of FireFox, I haven’t specified a version for FireFox, but for IE, there was a time when I was testing IE11 and IE8.  So, I have the version, 11, specified here for IE to tell the hub that this node runs IE11.</p>\n<p>The final parameter it took me quite a while to figure out was the –Dwebdriver.ie.driver.  This is how you tell the Node where the IEDriverServer lives.  I imagine there is a similar parameter for the other drivers as well.</p>\n<p>When you run this code, it will look something like this:</p>\n<p><img src=\"/uploads/2015/01/Node1.png\" alt=\"Node\" title=\"Node\"></p>\n<p>If you need the –Dwebdriver config information for another browser, you can google for Dwebdriver, and you should be able to find it.  Since the only officially supported Selenium driver is the IE driver, the config for the others may depend on the vendor who supplied the driver.  Oh, the joys of open source.</p>\n<p>And now, of course, to use all of this, you’ll need to specify in your code that you want to use the Grid drivers and through that, you’ll specify what browser you want the code to run on.</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> driver = <span class=\"keyword\">new</span> RemoteWebdriver(</span><br><span class=\"line\">    <span class=\"keyword\">new</span> Uri(<span class=\"string\">&quot;http://&#123;pathToHub&#125;:4444/wd/hub&quot;</span>),</span><br><span class=\"line\">    DesiredCapabilities.Firefox());</span><br></pre></td></tr></table></figure>\n\n<p>Or</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> driver = <span class=\"keyword\">new</span> RemoteWebdriver(</span><br><span class=\"line\">    <span class=\"keyword\">new</span> Uri(<span class=\"string\">&quot;http://&#123;pathToHub&#125;:4444/wd/hub&quot;</span>),</span><br><span class=\"line\">    DesiredCapabilities.InternetExplorer())</span><br></pre></td></tr></table></figure>\n\n<p>Finally, someone might say, “so why go to all this trouble when you could just use something like SauceLabs?” Well, even if you have SauceLabs setup for your continuous integration, I think you’ll still need something setup while you are creating your tests.  Yes, you could run without the grid while you are writing your test and use the grid as part of your continuous integration process, but my experience is that the grid works just enough differently that you are really better off creating your test using the grid.</p>\n<p>In my current situation, I have a virtual machine setup to run my test.</p>\n",
            "tags": [
                "node",
                "selenium",
                "grid",
                "hub"
            ]
        }
    ]
}