{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"code\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/8-reasons-johnny-does-not-write-bug-free-code/",
            "url": "http://davembush.github.com/8-reasons-johnny-does-not-write-bug-free-code/",
            "title": "8 Reasons Johnny Does Not Write Bug Free Code",
            "date_published": "2016-09-20T10:30:00.000Z",
            "content_html": "<p>There have been a number of things that have occurred over the last week that have prompted this particular post.  And for anyone I work with, this is not an indictment of our work place so much as it is an indictment of our industry.  PLEASE don’t take this personally.</p>\n<p>Some of those reasons will show up in this article.  But the question we need to examine today is why is it so hard to write bug free code.  And I’m not even talking about perfection.  Why is it that we miss the simple stuff?  The stuff that once it is found, we think, “how could we have missed that?!”.  I’m perfectly aware that all code has bugs some just haven’t been found yet.  I’m also aware that no matter how hard I try, the stupid bugs always make their way past my desk.</p>\n<figure>![](/uploads/2016/09/image-1.png \"8 Reasons Johnny Does Not Write Bug Free Code\")<figcaption>Photo credit: [~Pawsitive~Candie_N](//www.flickr.com/photos/scjn/3450910519/) via [Visualhunt](//visualhunt.com) / [CC BY](//creativecommons.org/licenses/by/2.0/)</figcaption></figure>\n\n<span id=\"more\"></span>\n\n<h2 id=\"No-Training\"><a href=\"#No-Training\" class=\"headerlink\" title=\"No Training\"></a>No Training</h2><p>Certainly not the only reason.  But at the same time I think this is a core reason.  Our industry really sucks when it comes to teaching computer science.  So much so, that I’ve written articles about how, for the most part, you don’t need a college education to become a programmer.  Maybe if we taught what programmers don’t already know how to do, a college education would be valuable.</p>\n<p>But what do we do instead?  We teach programmers how to program.</p>\n<p>Dumb! I think back to my education.  Here’s a basic summary of what I learned:</p>\n<ol>\n<li>COBOL, dBase III, JCS, CICS syntax.</li>\n<li>Break your code into functions</li>\n<li>A bit on how to do requirements analysis.</li>\n</ol>\n<p>Guess what?  I could have learned all of that on my own.  How do I know that?  Because I had already taught myself, Basic and C before.  I taught myself every language I’ve learned since.  I was already writing structured code, and still do.  And how we gather requirements has changed and somehow I managed to learn that on my own.  Programming is a learning profession.  It is one of the things that makes it attractive to me.</p>\n<p>But what didn’t I learn?  At no point did anyone ever teach me how to break my own code.  And while Test Driven Development wasn’t a thing when I was going to school.  I doubt they are teaching it today.  (Let me know if your school did or is.)</p>\n<h2 id=\"Happy-Path-Specs\"><a href=\"#Happy-Path-Specs\" class=\"headerlink\" title=\"Happy Path Specs\"></a>Happy Path Specs</h2><p>So, the programmers have no training.  But it isn’t just a programmer problem.</p>\n<p>When is the last time you got a specification from whoever creates them in your organization that had any more than a happy path set of requirements?  But, certainly there are things the system should not do.  I recently had to go asking for required fields and maximum field lengths in an application I was working on.  And that’s the simple stuff.</p>\n<h2 id=\"Not-My-Job\"><a href=\"#Not-My-Job\" class=\"headerlink\" title=\"Not My Job\"></a>Not My Job</h2><p>If you have a QA department, you might be tempted to leave testing to QA.  My personal goal is to make sure QA doesn’t find anything.  At least, not something really obvious.</p>\n<p>But I know that some programmers get sloppy about testing their code if they know the safety net of QA exist.</p>\n<p>There is also the problem of QA believing they are the only ones who test.  Strange, but true.  When QA found out I was writing unit test for a pretty complex piece of logic, I was asked, “Then what will be left for me to do?!”  Strange but true.</p>\n<p>But what if we started working as teams?  For example, what if I could get QA to help me develop my test plan?  What if developing software was a WE activity instead of several silo developers each doing their own thing?</p>\n<h2 id=\"Batch-Programming\"><a href=\"#Batch-Programming\" class=\"headerlink\" title=\"Batch Programming\"></a>Batch Programming</h2><p>This is one I really don’t understand.  But I know programmers who will write code for hours prior to running it.  Even if you did remember everything you coded, how can you possibly know where a bug is located if you wait that long?  You should be running your code every time you have something different that can be run so that you know what change caused a problem.  And don’t tell me you test every possible condition.  I know you don’t.</p>\n<p>Programmers who program like this are “Debbie Done” programmers.</p>\n<p>Why “Debbie Done”? There is this story about a programmer who used to work at one of the companies I worked at in the past.  She considered code done if it compiled and linked.</p>\n<p>I’m not as good at testing as I would like (yet) and I’m always embarrassed when someone finds a problem with my code.  So, I was shocked one day when I found out that a project manager wanted to give me some work because my code “always works.”  I knew that wasn’t true.  But when I reflected on what he was saying I realized that the difference in how I code and the other programmers he was comparing me to is that I write for a few minutes and then make sure that works before I continue on.</p>\n<h2 id=\"We-Don’t-Plan-to-Test\"><a href=\"#We-Don’t-Plan-to-Test\" class=\"headerlink\" title=\"We Don’t Plan to Test\"></a>We Don’t Plan to Test</h2><p>Ah.  And here we get a little closer to the truth.</p>\n<p>What do I mean by planning to test? For any spec you are working on, you should have, written out or coded, a repeatable set of steps that ensures that your code does what it should and doesn’t do what it shouldn’t.  This is what test driven development attempts to steer us toward.  I’m not going to go off on a rant about TDD again here.  But I will tell you that either having a written out test plan prior to coding enables me to ensure that my code does what the people who gave me the specification think it should.  It also forces me to think about ways I might break the code.  I know my code is delivered with less bugs because of this process.  Hopefully, I’ll get better at thinking of how to break my own code.</p>\n<p>Having a plan helps with the Debbie Done programmer as well as people who code more like me.</p>\n<p>Even though I code&#x2F;test incrementally, I still only test the code right after I’ve written it.  Once I think it is working, I don’t go back, even though something else I’ve written may have changed how the code is working.  Having repeatable tests has save me several times.</p>\n<h2 id=\"We-Don’t-Know-what-we-Don’t-Know\"><a href=\"#We-Don’t-Know-what-we-Don’t-Know\" class=\"headerlink\" title=\"We Don’t Know what we Don’t Know\"></a>We Don’t Know what we Don’t Know</h2><p>Even if we do everything right, we are still going to miss stuff.  One person can’t possibly figure out all that might go wrong.  It is how we deal with the problems once they are revealed that becomes the issue.  This is where we would, ideally, have the team come up with the test scenarios.</p>\n<h2 id=\"Shame-Driven-Development\"><a href=\"#Shame-Driven-Development\" class=\"headerlink\" title=\"Shame Driven Development\"></a>Shame Driven Development</h2><p>I actually heard a project manager say, “Shame on the developer if QA finds bugs.” Really?!  What about “Shame on the BA for not including that item in the requirements.”?  What about “Shame on the product owner for not mentioning it.”? Or what about no shame at all? While shame is a powerful motivator in the short term, it is a sure way to make sure your developers leave.</p>\n<p>That you only retain highly dysfunctional programmers.  Or that you can only retain programmers who can’t really code.</p>\n<p>Shame based development can only lead to even more bugs.  Not fewer.</p>\n<p>At some point I should probably write about the dangers of a shame based culture.   If your organization is using shame to manage personnel.  Get out!</p>\n<h2 id=\"Long-Hours\"><a href=\"#Long-Hours\" class=\"headerlink\" title=\"Long Hours\"></a>Long Hours</h2><p>Another way you can kill the overall effectiveness of your team is to make sure everyone works more than 45 hours a week for months or years at a time.  One of two things will happen, if not both.</p>\n<p>The code will suffer.  Want to introduce more bugs?  Keep everyone working overtime.  A week here or there is a different story.</p>\n<p>If the code doesn’t suffer, then you are likely to find a lot more socialization, social media activities, and just plain goofing off occurring.  People just can’t work that many hours.  Just because someone is at work for 10 hours doesn’t mean they are working 10 hours.  But hours are easy to measure, so this terrible practice continues.</p>\n<h2 id=\"We-Can’t-Fix-Everything\"><a href=\"#We-Can’t-Fix-Everything\" class=\"headerlink\" title=\"We Can’t Fix Everything\"></a>We Can’t Fix Everything</h2><p>I’m in a unique position in that I’m currently functioning as a Scrum coach.  This allows me to influence all the areas I’ve discussed.  As programmers, you can only influence your own stuff.  So, my recommendation to you is to concentrate on what you have control over.  Create a test plan prior to writing code.  Once you’ve learned how to do that, work on learning how to code those test so you don’t have to run them manually over and over again.  Do this slowly.  Maybe start with just one test.  Squeeze it into the cracks of your regular work.  Learning to test and learning to code test takes time, but it will make you a better programmer and will ultimately make you a more reliable and faster programmer.  Someday you might just hear that they want to give you an important job because “Johnny’s code always works.”</p>\n",
            "tags": [
                "tdd",
                "code",
                "agile",
                "scrum",
                "bug"
            ]
        },
        {
            "id": "http://davembush.github.com/15-ways-to-write-beautiful-code-that-have-nothing-to-do-with-testing/",
            "url": "http://davembush.github.com/15-ways-to-write-beautiful-code-that-have-nothing-to-do-with-testing/",
            "title": "15 Ways To Write Beautiful Code [That Have Nothing To Do With Testing]",
            "date_published": "2015-08-06T11:30:00.000Z",
            "content_html": "<p><img src=\"/uploads/2015/08/image.png\" alt=\"image\" title=\"image\"></p>\n<p>I got a question this last week that I answered very briefly but I felt that to answer it completely would take a blog post.  So here’s the blog post.</p>\n<blockquote>\n<p>Should the author of a piece of code be responsible for more than just unit testing, or does peer review have a play?</p>\n</blockquote>\n<span id=\"more\"></span>\n\n<p>Loaded question, right?  Obviously, the guy asking this question believes that an author should both unit test AND have peer review.  And I agree.  But to limit the role of a programmer to even those two things is a very narrow view of programming. Then I got to thinking about it and realized that most of what we’d be trying to accomplish with a code review encompasses everything we’d want to include in a list of things a developer is responsible for.  Further, a code review is mostly a review that ensures that 1) the code does what it is supposed to do, and 2) the code is easy to maintain in the future.</p>\n<p>In other words, all that the word “Peer review” or “Code review” encompasses is largely about code clarity.</p>\n<p>Code clarity addresses the issue we all have when we pick up a new piece of code.  Can you understand it easily?  I just listened to a <a href=\"//dotnetrocks.com/default.aspx?showNum=1172\">DotNetRocks episode</a> that was all about the fact that we spend most of our time reading code and yet no one is talking about how we might do this better.  One way we can read code better is by writing it more clearly in the first place.</p>\n<p>Here are 15 ways you can make your code easier to read:</p>\n<h2 id=\"Make-your-code-pretty\"><a href=\"#Make-your-code-pretty\" class=\"headerlink\" title=\"Make your code pretty\"></a>Make your code pretty</h2><p>I remember back when I was doing Clipper programming, we had one guy who would always show code that was ready to be printed in a text book.  I mean, regardless of what you had to say about what he had actually coded, the visual presentation of the code was a thing of beauty.  He had us believing that all of his code looked like that.  Then he went to work for some other company and we actually looked at the other code he had written.  It looked just like any other code.</p>\n<p>But it taught me a lesson.  A lesson I, unfortunately still need to be reminded of.  Pretty code is easier to maintain and implies a lot about the quality of the code.  Just like you wouldn’t go to an interview without wearing a suit because how you dress implies something about how you’ll program, your code should imply the quality by what it looks like before you ever start reading it.</p>\n<h2 id=\"Establish-and-obey-naming-conventions-for-your-code\"><a href=\"#Establish-and-obey-naming-conventions-for-your-code\" class=\"headerlink\" title=\"Establish and obey naming conventions for your code.\"></a>Establish and obey naming conventions for your code.</h2><p>I’ve written about this before.  Most notably when .NET first came out in the article about <a href=\"/hungarian-notation-use-what-works-spit-out-the-bones/\">Hungarian Notation</a>.  As I point out in that article, not using Hungarian notation doesn’t mean you don’t have any standards.  Sure, you don’t want to prefix all of your integers with a lower case “I”, because you don’t care what kind of number it is.  But it is valuable to prefix a button with “button” so that it is easier to find in your Intellisense, or if you need to search your code for what you named it, it is much easier to find all of the buttons in your code this way.</p>\n<p>But there is another reason to establish and obey naming conventions.  Once you’ve done this, it makes it easier for everyone who is using those common conventions to read your code.</p>\n<p>For example, where I work, we have what I consider a very odd naming convention.  All of our POCO classes (we generate this ourselves because we are using DB2) are all UPPERCASE_UNDERSCORE_SEPARATED.  And all our properties of POCO collections are named UPPERCASE_UNDERSCORE_SEPARATEDs.  It used to drive me crazy, mostly because I use <a href=\"/resharper\">ReSharper</a> religiously and the default rules aren’t setup to handle this odd convention.  But, it is a standard and, I can tell you now, you open a file that is using a POCO and you know you are dealing with a POCO.  No question about it! While I still don’t recommend the practice, I tell you that example because it illustrates how much a coding standard can instantly tell you something about the code you are working on before you ever start reading the code.</p>\n<h2 id=\"Establish-and-obey-a-common-architecture\"><a href=\"#Establish-and-obey-a-common-architecture\" class=\"headerlink\" title=\"Establish and obey a common architecture.\"></a>Establish and obey a common architecture.</h2><p>One of the biggest problems I have in reading other people’s code is if I can’t understand why they put things where they put them.  But having a common architecture that is easy to explain helps alleviate a lot of this problem.  One of the reasons I like working with frameworks is because much of the time these decisions are already made for you.  For example, just having a simple three tiered architecture that separates the View, Business Rules, and Data Access into different parts of your code can go a long way toward making code easy to read.  Within this basic framework you can layer in Model View Presenter, Model View Controller or any other design patterns.  Follow the mantra, “A place for everything and everything in its place” and your code will be much easier to follow.</p>\n<h2 id=\"Name-objects-as-nouns-methods-as-verbs\"><a href=\"#Name-objects-as-nouns-methods-as-verbs\" class=\"headerlink\" title=\"Name objects as nouns, methods as verbs.\"></a>Name objects as nouns, methods as verbs.</h2><p>This is so basic that I almost feel like I should have to write this here.  But I still see the principle violate all of the time.  So, here it is.  Obviously, if you aren’t following an object oriented methodology.  Say you are doing Functional or Procedural programming, you’ll need to adapt this rule to your environment.  But for OOP guys and gals.  Stop breaking this rule.  It is a sign of immaturity.</p>\n<h2 id=\"Name-variable-what-they-are\"><a href=\"#Name-variable-what-they-are\" class=\"headerlink\" title=\"Name variable what they are.\"></a>Name variable what they are.</h2><p>Similarly, stop with the short variable names unless you are using a language that is still so archaic as to require it.  I’ve written about this before.  Twice actually.  <a href=\"/tags/naming-conventions/\">With rants about using i, j and k as variable names</a>.  The point here is that you want to be able to read your code and to do that your code has to tell you something about what you are doing.  Short variable names almost always never assist in code readability.</p>\n<h2 id=\"Don’t-include-a-noun-in-your-method\"><a href=\"#Don’t-include-a-noun-in-your-method\" class=\"headerlink\" title=\"Don’t include a noun in your method.\"></a>Don’t include a noun in your method.</h2><p>This is different from just saying that method should be verbs.  There are a lot of places where I’ve seen code that has a verb AND a noun as a method name.  If you have a method that has both a noun and a verb in it, your class is probably trying to do too much.</p>\n<p>Wouldn’t it look funny if you had a Person class that had a method in it called FirstNameToLower()?</p>\n<h2 id=\"Establish-a-cyclomatic-complexity-threshold-for-your-methods-and-obey-them-religiously\"><a href=\"#Establish-a-cyclomatic-complexity-threshold-for-your-methods-and-obey-them-religiously\" class=\"headerlink\" title=\"Establish a cyclomatic complexity threshold for your methods and obey them religiously.\"></a>Establish a <a href=\"//en.wikipedia.org/wiki/Cyclomatic_complexity\">cyclomatic complexity</a> threshold for your methods and obey them religiously.</h2><p>Cyclomatic complexity takes into account how many statements have to be executed and, most importantly, how many conditionals have to be executed in your code.  The easiest way to reduce cyclomatic complexity is to reduce the number of conditions.  But aside from that, you can make your code much more readable by eliminating nesting where ever possible.</p>\n<p>One of my favorites is instead of writing code that looks something like this:</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"function\"><span class=\"keyword\">void</span> <span class=\"title\">SomeMethod</span>()</span></span><br><span class=\"line\">&#123;</span><br><span class=\"line\">   <span class=\"keyword\">if</span>(x != y)</span><br><span class=\"line\">   &#123;</span><br><span class=\"line\">      <span class=\"comment\">// do stuff here</span></span><br><span class=\"line\">   &#125;</span><br><span class=\"line\">&#125;</span><br></pre></td></tr></table></figure>\n\n<p>You can make your code much more readable by writing it like this:</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"function\"><span class=\"keyword\">void</span> <span class=\"title\">SomeMethod</span>()</span></span><br><span class=\"line\">&#123;</span><br><span class=\"line\">   <span class=\"keyword\">if</span>(x == y) <span class=\"keyword\">return</span>;</span><br><span class=\"line\">   <span class=\"comment\">// do stuff here</span></span><br><span class=\"line\">&#125;</span><br></pre></td></tr></table></figure>\n\n<p>Similarly, instead of nesting when this doesn’t work, as with while statements that contain other while statements, why not create a method for each while statement?</p>\n<h2 id=\"Make-code-“self-documenting”\"><a href=\"#Make-code-“self-documenting”\" class=\"headerlink\" title=\"Make code “self-documenting”\"></a>Make code “self-documenting”</h2><p>That is, if you feel your code needs a comment, you probably have violated one or more of the other readability suggestions.  This is not to say that you should never add comments, but they should not be a replacement for readable code.  I generally leave comments for WHY I did something and leave the WHAT I did to the code.</p>\n<h2 id=\"Don’t-add-comments-for-things-that-you-can-deduce-by-reading-the-code\"><a href=\"#Don’t-add-comments-for-things-that-you-can-deduce-by-reading-the-code\" class=\"headerlink\" title=\"Don’t add comments for things that you can deduce by reading the code.\"></a>Don’t add comments for things that you can deduce by reading the code.</h2><p>“This next line increments loopVar by 1” does no one any good and could eventually end up being litter in your code that makes the code harder to read.  Why?  Because it is possible for loopVar to get renamed, or removed and the comment could stick around forever.  Until we get compilers that verify our comments as well as our executable code, referencing variables in comments is a generally bad practice that should be avoided.</p>\n<h2 id=\"Is-the-code-SOLID\"><a href=\"#Is-the-code-SOLID\" class=\"headerlink\" title=\"Is the code SOLID?\"></a>Is the code <a href=\"/pluralsightSOLID\">SOLID</a>?</h2><ul>\n<li>Single Responsibility of classes</li>\n<li>Open&#x2F;Close Principle</li>\n<li>Liskov Substitution Principle</li>\n<li>Interface Segregation Principle</li>\n<li>Dependency Inversion</li>\n</ul>\n<h2 id=\"Is-the-code-testable\"><a href=\"#Is-the-code-testable\" class=\"headerlink\" title=\"Is the code testable?\"></a>Is the code testable?</h2><p>If you follow all the rules above, the code should be easy to test.  But, this is something that you should review your code for explicitly.</p>\n<h2 id=\"Will-the-code-fail\"><a href=\"#Will-the-code-fail\" class=\"headerlink\" title=\"Will the code fail?\"></a>Will the code fail?</h2><p>Can anyone write code that uses any particular method that would make the method crash, throw an exception, or otherwise do something that was never intended?</p>\n<h2 id=\"Code-duplications\"><a href=\"#Code-duplications\" class=\"headerlink\" title=\"Code duplications.\"></a>Code duplications.</h2><p>I don’t know about you, but I’m pretty sure I’ve got code that looks practically the same littered throughout my code base.  One of my current goals is to make myself create a new method any time I’m getting ready to copy and paste more than three lines of code.</p>\n<h2 id=\"100-Code-Coverage\"><a href=\"#100-Code-Coverage\" class=\"headerlink\" title=\"100% Code Coverage\"></a>100% Code Coverage</h2><p>Assuming you have unit test, do you have 100% code coverage on all of the methods that have a cyclomatic complexity score greater than 1?  I’m talking about code you’ve written.  I’ve written before about <a href=\"/100-code-coverage/\">what code should be tested</a> and what code doesn’t need to be tested.</p>\n<h2 id=\"Learn-the-vocabulary-of-your-language\"><a href=\"#Learn-the-vocabulary-of-your-language\" class=\"headerlink\" title=\"Learn the vocabulary of your language\"></a>Learn the vocabulary of your language</h2><p>John Sonmez wrote a very compelling article in 2013 about <a href=\"//simpleprogrammer.com/2013/04/14/what-makes-code-readable-not-what-you-think/\">what makes code readable</a>.  In it he says that just like when we learn to read.  Code that is readable by a senior level developer may not be readable by an entry level developer simply because the entry level developer doesn’t have a firm grasp of the language.  Like John, I’ve been criticized for using the ternary operator because it is too terse.  Not descriptive enough.  Un-readable.  And I’ve always responded that arguing that the syntax isn’t clear is like arguing that a sentence isn’t clear because it uses a word you aren’t familiar with.  The word may actually be the perfect word for what the author is trying to communicate.  Your understanding of that word does not make the writing bad.  It just means the reader has some more learning to do.</p>\n",
            "tags": [
                "code",
                "programming"
            ]
        }
    ]
}