{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"inversion of control\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/why-is-it-called-%E2%80%9Cinversion-of-control%E2%80%9D/",
            "url": "http://davembush.github.com/why-is-it-called-%E2%80%9Cinversion-of-control%E2%80%9D/",
            "title": "Why Is It Called “Inversion of Control”?",
            "date_published": "2015-06-11T10:00:00.000Z",
            "content_html": "<p><img src=\"/uploads/2015/05/CHIL0007.png\" alt=\"CHIL0007\" title=\"CHIL0007\"></p>\n<p>There is a guy I’m working with who is trying to wrap his head around design principles.  He’s been watching a lot of <a href=\"/pluralsight\">PluralSight videos</a>.  As he was processing information about <a href=\"/pluralsightIoC\">Inversion of Control</a>, he asked the natural question I’ve never actually considered before.  “Why is it called Inversion of Control?  Normally, when you talk about ‘Inversion’ you are talking about reversing something or negating something.  That isn’t what we are doing here.”</p>\n<span id=\"more\"></span>\n\n<h2 id=\"What-Is-Inversion-of-Control\"><a href=\"#What-Is-Inversion-of-Control\" class=\"headerlink\" title=\"What Is Inversion of Control?\"></a>What Is Inversion of Control?</h2><p>So, let’s start with a definition of what Inversion of Control is.  And let’s start the definition by explaining what it isn’t. In the old days, back when I started programming.  We had this thing called “Procedural Programming.” Control of your application flowed from beginning to end with looping to take care of any kind of waiting that needed to take place.  <a href=\"//martinfowler.com/bliki/InversionOfControl.html\">Martin Fowler describes this</a> using an illustration that is version similar to a basic “How to program in C#” console application that is in the beginning of most beginner programming books.</p>\n<blockquote>\n<p>Let’s consider a simple example. Imagine I’m writing a program to get some information from a user and I’m using a command line enquiry. I might do it something like this</p>\n<p>  #ruby<br>  puts ‘What is your name?’<br>  name &#x3D; gets<br>  process_name(name)<br>  puts ‘What is your quest?’<br>  quest &#x3D; gets<br>  process_quest(quest)</p>\n<p>In this interaction, my code is in control: it decides when to ask questions, when to read responses, and when to process those results.</p>\n</blockquote>\n<p>What Inversion of Control does is that it puts something other than the main code in charge of doing critical parts of the program so that those other parts of the program can be swapped out by the person implementing the code.</p>\n<h2 id=\"Examples-of-Inversion-of-Control\"><a href=\"#Examples-of-Inversion-of-Control\" class=\"headerlink\" title=\"Examples of Inversion of Control\"></a>Examples of Inversion of Control</h2><p>If you’ve ever written a WebForms or Windows Forms application, you’ve already experience inversion of control.</p>\n<h3 id=\"OnPageLoad-or-OnFormLoad\"><a href=\"#OnPageLoad-or-OnFormLoad\" class=\"headerlink\" title=\"OnPageLoad() or OnFormLoad()\"></a>OnPageLoad() or OnFormLoad()</h3><p>You have probably never even given this much thought.  You think these two methods are where your code starts.  But the reality is, the code started long before these methods ever got called.  The thing that is in control is the .NET framework.  You’ve created a delegate that gets called by the framework so that your page or form does what you want it to.  Without this inversion of control, you would have to write a whole lot more code.</p>\n<h3 id=\"Event-Handlers\"><a href=\"#Event-Handlers\" class=\"headerlink\" title=\"Event Handlers\"></a>Event Handlers</h3><p>While you might think of OnPageLoad and OnFormLoad as event handlers, the way they are implemented are more like virtual functions.  Event handlers, on the other hand, are a specific type of delegate that say, “When this thing happens, let me know about it.”  The code that fires the event doesn’t even really care what you do during the event.  Again, the control has been “Inverted” because there is a lot of code that is running that you have no control over and probably have no knowledge of.</p>\n<h3 id=\"Virtual-Functions\"><a href=\"#Virtual-Functions\" class=\"headerlink\" title=\"Virtual Functions\"></a>Virtual Functions</h3><p>One of my favorite methods of inverting control is to use virtual functions.  I can have a parent class that controls the flow of the program that calls various virtual functions in order.  But my child class can provide the implementation of the functions to make them do various things.  I used this, at one time in the past, to create a framework for submitting links to various bookmarking sites.  They all worked essentially the same way, all I had to do was implement the specific details for each site while 80% of my code stayed the same in the base class.</p>\n<h3 id=\"Delegates-or-Callback-Functions\"><a href=\"#Delegates-or-Callback-Functions\" class=\"headerlink\" title=\"Delegates or Callback Functions\"></a>Delegates or Callback Functions</h3><p>Another common way of implementing inversion is by using delegates or callbacks.  This work in a similar way to virtual functions expect that the functions are typically passed in to a method.  Much of the current implementation of JavaScript uses this method of inverting control as a primary pattern (but not limited to it as the only way.)</p>\n<h3 id=\"Dependency-Injection\"><a href=\"#Dependency-Injection\" class=\"headerlink\" title=\"Dependency Injection\"></a>Dependency Injection</h3><p>I’ve <a href=\"/dependency-injection-not-di/\">talked about Dependency Injection before</a>.  Again, it is another way of delegating control to something other than the code that has main control.  What I want to make special note of here, though, is that Inversion of Control is not Dependency Injection but Dependency Injection is a form of Inversion of Control.  I think this is where most of the confusion about Inversion of Control comes from.  Most of the literature that talks about Inversion of Control talks about it at the same time they are talking about Dependency Injection.  As though the two concepts were the same.</p>\n<h2 id=\"Why-Inversion-of-Control-Matters\"><a href=\"#Why-Inversion-of-Control-Matters\" class=\"headerlink\" title=\"Why Inversion of Control Matters\"></a>Why Inversion of Control Matters</h2><p>Finally, I want to talk for a bit about why Inversion of Control matters.  Because, for me, it is a lot more important that we understand what we are trying to achieve than it is that we’ve given it the right name or that we even know what name to call it.  All of the examples I’ve provided are things you’ve probably done in your code.  Some of them you’ve done without even knowing you were doing them.  But think about the alternative of not doing them. First, your code would be a lot harder to maintain.  Just think of how hard it would be to write a web site and maintain it if you had to write code that handled all of the work that happens for you behind the scenes. Second, it makes the code more loosely coupled.  And by doing that, it makes the code testable AND it makes the code more flexible and easy to change in the future. Maybe instead of calling it Inversion of Control it should have been called Delegation of Control.  Either way, the concept is to remove as much code as possible from our main controlling code and give the implementation responsibility to something else that can be swapped in without having to change the main loop.</p>\n",
            "tags": [
                "design patterns",
                "inversion of control",
                "ioc"
            ]
        }
    ]
}