{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"immutable\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/what-if-everything-was-immutable/",
            "url": "http://davembush.github.com/what-if-everything-was-immutable/",
            "title": "What if Everything Was Immutable?",
            "date_published": "2017-01-10T12:30:00.000Z",
            "content_html": "<p>The first time a programmer who was trained in the classical procedural&#x2F;object oriented history is confronted with the concept of making everything immutable, the first question that comes to mind is, “won’t that make my application slow?”  This is because of how most programmers have been trained.  Making everything immutable generally means that we must copy a lot of memory from one place to another.  Moving memory around is generally considered slow.</p>\n<p>And so, most programmers dismiss the whole idea as crazy talk.  But is it really all that crazy?</p>\n<figure>![](/uploads/2016/12/image-4.png \"What if Everything Was Immutable?\")<figcaption>Photo credit: [Paul Stevenson](//www.flickr.com/photos/pss/354177349/) via [Visualhunt](//visualhunt.com) / [CC BY](//creativecommons.org/licenses/by/2.0/)</figcaption></figure>\n\n<span id=\"more\"></span>\n\n<h2 id=\"Two-Paths\"><a href=\"#Two-Paths\" class=\"headerlink\" title=\"Two Paths\"></a>Two Paths</h2><p>So, let’s look at some computer history.  If you’ve been in this industry any length of time, you’ve probably heard the name Turing and you know the Turing machine has something to do with programming.  But you may not know how it impacts your day to day programming life.</p>\n<p>In short, Turing is the guy we can point to as the father of modern computing, complete with the fact that we generally process everything sequentially.  It is this sequential processing that causes us to have instructions working on memory and it has served us well.</p>\n<p>But there is another branch of computer science that was made popular by Alonzo Church that is based on Lambda Calculus.  This branch of computer science is where the bulk of Functional Programming can be traced back to.  In this branch, everything is a function.  Any parameters you pass in cannot have their state changed and the value that is returned is a new value.</p>\n<p>The main benefits to this newer functional style are:</p>\n<ul>\n<li>If I pass in the same parameters, I’ll always get back the same value.</li>\n<li>State is never mutated accidentally because state is never mutated.</li>\n<li>Functions never have an unpredictable side effect.</li>\n</ul>\n<p>Just think of how many bugs you wouldn’t have introduced into your code had this been true when you wrote it.</p>\n<h2 id=\"Convergence\"><a href=\"#Convergence\" class=\"headerlink\" title=\"Convergence\"></a>Convergence</h2><p>Recently, functional programming has become more popular and the two branches of computer science have started to merge.  Taking the best of both worlds and using what makes sense from each.  But, we’ve already had at least one immutable object in most of our object-oriented languages.  The String object.  So, what does String give us that we use nearly every day?</p>\n<h2 id=\"Immutable-Strings\"><a href=\"#Immutable-Strings\" class=\"headerlink\" title=\"Immutable Strings\"></a>Immutable Strings</h2><h3 id=\"No-Side-Effects\"><a href=\"#No-Side-Effects\" class=\"headerlink\" title=\"No Side Effects\"></a>No Side Effects</h3><p>As we’ve already mentioned, that fact that something is immutable means it can’t be changed.  So, when you pass a string as a parameter, even though it is an object, the string won’t change if the function changes the string.  This is good news because the calling function doesn’t have to protect itself against unintended consequences.</p>\n<h3 id=\"Memory-Efficiency\"><a href=\"#Memory-Efficiency\" class=\"headerlink\" title=\"Memory Efficiency\"></a>Memory Efficiency</h3><p>The other thing that happens with immutable object is that every string representation only exist once.  So, we never duplicate memory.</p>\n<p>What do I mean by this? Well, take this example from C#</p>\n<figure class=\"highlight javascript\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">var</span> string1 = <span class=\"string\">&quot;abc&quot;</span>;</span><br><span class=\"line\"><span class=\"keyword\">var</span> string2 = <span class=\"string\">&quot;abc&quot;</span>;</span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">if</span> (string1 == string2) &#123;</span><br><span class=\"line\">  <span class=\"title function_\">writeLn</span>(<span class=\"string\">&#x27;is equal&#x27;</span>);</span><br><span class=\"line\">&#125;</span><br></pre></td></tr></table></figure>\n\n<h3 id=\"Testing-Equality\"><a href=\"#Testing-Equality\" class=\"headerlink\" title=\"Testing Equality\"></a>Testing Equality</h3><p><code>string1</code> and <code>string2</code> point to the same object “abc” not two different instances of “abc”.  This is why we can write <code>string1 == string2</code>.  Unfortunately, the &#x3D;&#x3D; operator is overloaded so we are still doing string comparison.  </p>\n<p>But if you want efficiency, you can use the <a href=\"/net-string-pool-not-just-for-the-compiler/\">Intern()</a> method and ReferenceEquals() to bypass this overload and use pointer comparison.  This is a good thing because we test for string equality and inequality so often the performance penalty we incur from making strings immutable is more than offset by the performance gains we get testing for equality.</p>\n<h2 id=\"Make-Everything-Immutable\"><a href=\"#Make-Everything-Immutable\" class=\"headerlink\" title=\"Make Everything Immutable\"></a>Make Everything Immutable</h2><p>If you think about the code you typically write, how much of the time would you benefit from every object in your code working in a similar way to strings? Wouldn’t it be a great thing if you knew that when you passed an object into a function, that function was not going to change the object at all?  Can you think of times that might have prevented a bug? Think of the memory optimizations you would benefit from.</p>\n<p>And how much easier would it be to test for equality if all you had to test was a memory pointer?  Not only would it be fast, but it would be reliable and a lot less work to code.</p>\n<h2 id=\"Immutability-is-Hard-–-or-is-it\"><a href=\"#Immutability-is-Hard-–-or-is-it\" class=\"headerlink\" title=\"Immutability is Hard – or is it?\"></a>Immutability is Hard – or is it?</h2><p>So now that you know what the benefits are, you are probably thinking, “Yes, but coding immutability into a language that doesn’t support it natively is a lot of work.  It is so much easier to write code the way I always have, even if it isn’t quite a safe.” Yes, I feel your pain.  But there are libraries for that.  Say you could get all the benefits of immutability with very little programming or performance cost?  Would you be interested? I know I was.  Just having the benefits of immutable data with the performance was benefit enough for me.  But then I was introduced to <a href=\"//facebook.github.io/immutable-js/\">immutable.j</a>s and I realized that I could have all of the benefits with a lot less performance cost than I was expecting because the library uses data structures that allow us to manipulate pointers rather than raw data.  The result is that only pointers to data that have actually changed change.  Nearly everything else stays as it was and adding items to List instead of arrays and Maps ends up being a lot more efficient.</p>\n<h2 id=\"Impact-on-Angular2\"><a href=\"#Impact-on-Angular2\" class=\"headerlink\" title=\"Impact on Angular2\"></a>Impact on Angular2</h2><p>By using immutable object in Angular2 along with libraries like <a href=\"//github.com/ngrx/store\">NgRX&#x2F;Store</a> you can see some major performance increases because the view will be able to determine when it needs to change based on simple object pointer comparison rather than checking entire objects.  For compute-intensive tasks, this is going to be a huge benefit.</p>\n<p>But it is also well worth learning how to use this before you ever need it simply because it will be a new way of thinking about your project that may take some time to get accustomed to.</p>\n",
            "tags": [
                "angular",
                "javascript",
                "immutable"
            ]
        }
    ]
}