{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"ci. continuous integration\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/make-your-test-work-for-you/",
            "url": "http://davembush.github.com/make-your-test-work-for-you/",
            "title": "Make Your Test Work For You",
            "date_published": "2014-04-18T15:53:00.000Z",
            "content_html": "<p><img src=\"/uploads/2014/04/TDD-CI.png\" alt=\"TDD-CI\" title=\"TDD-CI\"> So far we’ve been talking about creating test as part of the development process.  If all you ever used those test for was to make the design of your systems better, you would already be far ahead of most of your peers.</p>\n<p>But now that we have test, we might as well get as much mileage out of them as possible.  To do that, we are going to run our test every time we make a change.</p>\n<p>Now, you COULD run your test every time you make a change manually.  But who has time for that?  Certainly not me.  I doubt you do either.  And even if we did have time, there are better things we could be doing with that time if we could have those test run for us by some other process.</p>\n<span id=\"more\"></span>\n\n<h2 id=\"Continuous-Integration\"><a href=\"#Continuous-Integration\" class=\"headerlink\" title=\"Continuous Integration\"></a>Continuous Integration</h2><p>For this we need a continuous integration server.  Here’s what you want to make sure your CI server is able to do.</p>\n<ul>\n<li>Run your unit test</li>\n<li>Run your integration test</li>\n<li>Run your acceptance test</li>\n</ul>\n<p>To make sure it can do that, it will also need to be able to pull the source code from version control every time a new change is committed and build the new version.  I would bet that IF you have a CI server at all, this is all that it does.</p>\n<p>It needs to be able to notify  the developer who put the change in that the change caused a problem.  Ideally, it wouldn’t even allow  a change to go into your version control system if committing the change would cause the build or the test to fail.</p>\n<p>By implementing a CI server you are well on your way to ensuring that whatever is in version control can be released without causing any problems.</p>\n<h2 id=\"CI-Setup\"><a href=\"#CI-Setup\" class=\"headerlink\" title=\"CI Setup\"></a>CI Setup</h2><p>Since unit test are the core of your system, you’ll want to make sure that you run these test with every build.  But your integration test, and especially your acceptance test are going to take a lot longer than is practical to run as part of the process that runs with each check in.  I’ve been working on one scree of a system and so far I have about 30 hours of acceptance&#x2F;integration test using Selenium to drive 3 different web browsers.  Even if I narrowed the test down to one browser, that’s about 10 hours of test.  I don’t want to wait 10 hours to find out that my build worked (or not) and the changes that one of those test will fail is pretty small.  So, I’ve scheduled half of my test to run on one day and half of them to run on another day.</p>\n<p>With a good CI setup, you can be sure that changes you are making are not breaking code you’ve already confirmed is working.</p>\n",
            "tags": [
                "tdd",
                "test driven development",
                "CI. Continuous Integration"
            ]
        }
    ]
}