{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"magic strings\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/magic-strings-and-magic-numbers/",
            "url": "http://davembush.github.com/magic-strings-and-magic-numbers/",
            "title": "Magic Strings and Magic Numbers",
            "date_published": "2014-12-18T12:00:00.000Z",
            "content_html": "<p>This past week a very old (last time I did work for him was in 2007) client of mine contacted me because their program suddenly started exhibiting a problem.  It seems that if a user enters a date anytime in 2015, the program displays an error message indicating that they need to enter a date greater than today and less than two years from today.</p>\n<p>When I went to replicate the error in my debugger, I discovered this bit of code:</p>\n<figure class=\"highlight c++\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">if</span> (Year &lt; <span class=\"number\">100</span>)</span><br><span class=\"line\">&#123;</span><br><span class=\"line\">    <span class=\"keyword\">if</span> (Year &lt; <span class=\"number\">15</span>)</span><br><span class=\"line\">    &#123;</span><br><span class=\"line\">        Year += <span class=\"number\">2000</span>;</span><br><span class=\"line\">    &#125;</span><br><span class=\"line\">    <span class=\"keyword\">else</span></span><br><span class=\"line\">    &#123;</span><br><span class=\"line\">        Year += <span class=\"number\">1900</span>;</span><br><span class=\"line\">    &#125;</span><br><span class=\"line\">&#125;</span><br></pre></td></tr></table></figure>\n\n<span id=\"more\"></span>\n\n<p>So that, if you enter any date as 15, it assumes the date is 1915 instead of 2015.</p>\n<p>Now, we are talking about code here that has been around since the DOS days, and I’m pretty sure this particular routine has been around since then too.  I’m sure when it was coded, the year 2015 seemed so distant, that no one considered that the program might actually still be running in some form.</p>\n<p>But, that’s just the problem with Magic Strings and Magic Numbers.  They can appear to work for years, even decades, and then one day they show themselves for the evil they are.</p>\n<p>So, how can you guard yourself against using Magic Strings or Magic Numbers? That’s just the issue.  You can’t.  Sometimes they are only obvious once they manifest themselves as a bug.  However, here are a set of common places you should look.</p>\n<h2 id=\"Are-you-working-with-dates\"><a href=\"#Are-you-working-with-dates\" class=\"headerlink\" title=\"Are you working with dates?\"></a>Are you working with dates?</h2><p>Yeah, I know, this one is obvious since that’s what we are talking about.  But here are some other places you might want to look.</p>\n<p>As I’ve considered how I might fix this bug, I’ve decided that what I’ll do is get the current year, find the two digit version and add three to it.  I’ll use that computed date as the century roll over.</p>\n<p>But code is immortal.  That’s not the only place in this code that needs fixing.  The other place is the 1900 and 2000.  Those should be computed as well.  Not that I plan on being around, in the year 2100 and following, but as long as this code has been around, I should plan on the code being around then.  And it won’t be that much more work to compute those centuries as  century of today and century of today minus 100.</p>\n<p>The only constant I can see using in the code above is the 100.  Even if it does change, I don’t think anyone will complain too loudly when it does.</p>\n<h2 id=\"Databases\"><a href=\"#Databases\" class=\"headerlink\" title=\"Databases\"></a>Databases</h2><p>Another obvious place to look is in your database code.</p>\n<p>Actually, if you aren’t careful, there are a lot of mistakes you can make here.  But for now, let’s just stick to magic string issues.</p>\n<h3 id=\"Connection-Strings\"><a href=\"#Connection-Strings\" class=\"headerlink\" title=\"Connection Strings\"></a>Connection Strings</h3><p>By now, this should be obvious.  Don’t include the connection string to your database in the code of your program.  At the very least, put it in your web.config or app.config file so it can be changed without recompiling your code.</p>\n<h3 id=\"SQL\"><a href=\"#SQL\" class=\"headerlink\" title=\"SQL\"></a>SQL</h3><p>If you’ve done any amount of programming, you should know by now that your SQL belongs in your SQL database as a stored procedure.  That’s the best place for it.  However, I’ve had occasions where getting the SQL changed by the SQL gods, otherwise known as the DBAs, is so painful, that including the SQL in your code is much more practical.</p>\n<p>Here’s a tip.  Keep your SQL code separate from your other code.  Put it in a resource file.  Put it in a text file.  Just don’t put it in your C# or VB.NET code.</p>\n<h3 id=\"POCOs\"><a href=\"#POCOs\" class=\"headerlink\" title=\"POCOs\"></a>POCOs</h3><p>Are you generating POCOs to accompany your SQL?  Assuming you can’t use Entity Framework and you have to generate your own POCOs, you should generate your POCOs from your SQL.  That way, if your SQL changes, your POCO code changes automatically.</p>\n<h3 id=\"Schemas-Change\"><a href=\"#Schemas-Change\" class=\"headerlink\" title=\"Schemas Change\"></a>Schemas Change</h3><p>And while we are talking about Schemas, I’ll remind you that Schemas change.  Do you have a strategy in place so that you can tell what version of the database schema you are using at any particular time?</p>\n<h2 id=\"The-File-System\"><a href=\"#The-File-System\" class=\"headerlink\" title=\"The File System\"></a>The File System</h2><p>File system issues have frustrated me on several occasions.  The most obvious one is the difference between Mac&#x2F;Linux and Windows.  Now that .NET is going to be available on Mac and Linux, this is something you’ll want to pay attention too.  But, you should also pay attention to assumptions like drive letters.  Will you always want your code saved in this location.</p>\n<p>We had an issue years ago with the same code base I referred to above when Vista came out and you could no longer save your data files with your program files.  It took several hours of refactoring to get that code into a location that the user had rights to.  That should be a lesson for you.  Once again, just because a hard coded value works today, doesn’t mean it will work tomorrow.</p>\n<h2 id=\"Dave’s-Law-of-N\"><a href=\"#Dave’s-Law-of-N\" class=\"headerlink\" title=\"Dave’s Law of N\"></a>Dave’s Law of N</h2><p>This next one is not one you’d naturally think of as a Magic Number, but it is.</p>\n<p>You go to the customer and get requirements that say there will be two of something.  Maybe the contact record will have two phone numbers.  Or maybe they say there will be three of something.  It doesn’t really matter.  The magic number here is in the number of items that you need to store.</p>\n<p>I’ve seen this violated in a number of ways.  But the interview question I now ask is something along the lines of, “You need to store a person class in the database with FirstName, LastName, BirthDate, HomePhone, and CellPhone.  Create a database schema to hold this information.</p>\n<p>If they don’t come back to me with at least two tables, one for the Person and one for Phone numbers, I won’t hire them.  They get bonus points if they also create a third table so that we can classify the phone numbers in the phone number table.</p>\n<p>And that’s where “Dave’s Law of N” comes in.</p>\n<blockquote>\n<p>If there is two of something there WILL be three of something. </p>\n</blockquote>\n<p>Code it today so that tomorrow we can add the third item without coding.  It won’t take you any longer to do it right today and it will save us time when they eventually realize they should have asked for more.</p>\n<p>Well, I’m sure that’s not all of the places you should look.  But that’s a start to get you thinking in the right direction.</p>\n",
            "tags": [
                "c#",
                "vb.net",
                "magic numbers",
                "magic strings"
            ]
        }
    ]
}