{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"empty\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/c-%E2%80%9C%E2%80%9D-better-than-string-empty/",
            "url": "http://davembush.github.com/c-%E2%80%9C%E2%80%9D-better-than-string-empty/",
            "title": "C# “” better than string.Empty?",
            "date_published": "2009-04-20T08:43:00.000Z",
            "content_html": "<p><img src=\"/uploads/2009/04/arct013.jpg\" alt=\"arct-013\" title=\"arct-013\">I recently read an article that argued that “” is “Better than String.Empty”</p>\n<p>The argument is that since string.Empty doesn’t work in all situations, we should not use it at all.  He further argues that since the compiler can’t optimize code using string.Empty, the performance gains we might lose due to our lack of this optimization further supports the argument that we should not use it at all.</p>\n<p>But at what price?</p>\n<span id=\"more\"></span>\n\n<p>First, it is impressive that he took the time to evaluate the performance hit that using String.Empty can cause.  I’m pretty sure his evaluation of using String.Empty in a case statement is from his attempt to do so only to find out he couldn’t.</p>\n<p>However, he seems to have overlooked the price of not using String.Empty.  Certainly, Microsoft didn’t put that there without thinking about what they were doing.</p>\n<p>So let’s further evaluate what is happening in our code when we use “” rather than using String.Empty.</p>\n<p><strong>Consider Real World Optimization</strong></p>\n<p>In the article referenced, he does one, and only one, bench mark to prove that “” is faster than String.Empty by putting the code in a loop that could be optimized out.</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">if</span> (<span class=\"built_in\">string</span>.Empty == <span class=\"literal\">null</span>) &#123; <span class=\"keyword\">throw</span> <span class=\"keyword\">new</span> Exception(); &#125;</span><br></pre></td></tr></table></figure>\n\n<p>vs</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">if</span> (<span class=\"string\">&quot;&quot;</span> == <span class=\"literal\">null</span>) &#123; <span class=\"keyword\">throw</span> <span class=\"keyword\">new</span> Exception(); &#125;</span><br></pre></td></tr></table></figure>\n\n<p>But what about a real world scenario where the code is NOT optimized out?</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">String s = String.Empty;</span><br></pre></td></tr></table></figure>\n\n<p>vs</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">String x = <span class=\"string\">&quot;&quot;</span>;</span><br></pre></td></tr></table></figure>\n\n<p>In my test, there was no noticeable difference.  Sometimes string.Empty was faster and sometimes the empty string was faster.   And I expect the reason they are about the same is because the compiler optimized out the assignment.</p>\n<p>In real life, I would expect String.Empty to take just slightly longer.  But not enough to make it worth worrying about.</p>\n<p><strong>Consider String Comparison Cost</strong></p>\n<p>Second, string comparisons are notoriously expensive in every language I’ve ever worked in.  Including the .NET languages.  Instead of arguing that we can’t using String.Empty in a case statement, we would do better to argue that using a string in a case statement is the last of the possible alternatives we might use.</p>\n<p>When evaluating for the empty string, for example, you might check the string’s length rather than checking the string itself. For other strings, you might check the first character of the string.</p>\n<p><strong>Writing Code is About Solving Problems</strong></p>\n<p>When I started my career, computers were slow and had a limited amount of memory.  Writing the smallest amount of code that performed in the most efficient way was half the struggle of writing the application.</p>\n<p>Today, neither of those issues are of primary concern.  The first order of concern is to write an application that works.  Once it is DOING what it is supposed to do, IF there are performance issues, we should do proper code evaluation to determine where the performance bottlenecks are and then, and only then, should we optimize our code for performance.</p>\n<p>Generally, using String.Empty will serve you better than using “”.  In the cases where String.Empty will not work either because of the code evaluation OR because of the performance considerations, yes, use “” instead.  But, do it because there is a supportable reason, not because you think it may produce faster code.</p>\n<p>In fact, I would argue that if your code has performance problems, the last place you should be looking is at this issue.  You’ll get negligible gains. Your real problem is more likely in file IO, including database access and network access.</p>\n",
            "tags": [
                "c#",
                "empty",
                "string"
            ]
        }
    ]
}