{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"emotions\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/the-tyranny-of-emotions/",
            "url": "http://davembush.github.com/the-tyranny-of-emotions/",
            "title": "The Tyranny of Emotions",
            "date_published": "2018-09-01T10:30:33.000Z",
            "content_html": "<p>Emotions are a weird element of being human.  They can propel us forward or hold us back.  Sometimes they are violent.  Most of the time they whisper. </p>\n<p>Several events have occurred recently that have me thinking about this more. </p>\n<p>To start with, I’ve started paying more attention to my health.  There were a lot of things holding me back from this in the past.  It turns out, most of what was holding me back was just a lie. </p>\n<p>I’ve started interviewing again.  The nature of what I do means I get to do this a lot.  You’d think I’d get used to it.  But, I don’t like the interview process.  I don’t like changing jobs.  I really don’t like code interviews.  But, I do them because I like to program for a living.</p>\n<p>And for those of you who know me, just because I’m interviewing doesn’t mean I don’t like where I am and have any intention of leaving.  I interview when I have work so I still have the skill when I don’t have work.  And who knows?  I may just find something I like better than where I am.</p>\n<p>Some of the interviews I’ve been on have revealed that managers think in similar short-term ways that I have.  Short-term thinking is so easy to see when it is someone else. <figure><img src=\"/uploads/2017/08/2017-08-19.png\" title=\"The Tyranny of Emotions\"><figcaption>Photo credit: <a href=\"//www.flickr.com/photos/whinmobzappmedia/16016836686/\">whinmobzappmedia</a> via <a href=\"//visualhunt.com/re/fb1f6a\">VisualHunt</a> &#x2F; <a href=\"//creativecommons.org/licenses/by/2.0/\"> CC BY</a></figcaption></figure></p>\n<span id=\"more\"></span>\n\n<h2 id=\"Health\"><a href=\"#Health\" class=\"headerlink\" title=\"Health\"></a>Health</h2><p>I was under the misconception that if I paid more attention to my health, it would take time away from things I would rather be doing.  As it turns out, paying attention to my health has more than made up for the time it has taken. </p>\n<p>I was “afraid” of being uncomfortable.  I admit it.  I’m generally a pain wimp.  I wasn’t looking forward to sweating.  But it turns out, you get use to stuff like that. </p>\n<p>Now, the question to ask here is, “what was it that was keeping me from trying and what was it that got me started?” </p>\n<p>In a word, fear.  I was afraid I was going to lose the ability to do things that I considered more fun.  I was afraid of the discomfort. </p>\n<p>Now, the thing that got me started was slowly being exposed to the many benefits of living a slightly healthier life style.  I can’t say when exactly I started thinking I might want to make some changes, but I can tell you the first step was asking myself, “what can I do that is sustainable?” </p>\n<p>I’ve learned, “what can I do?” is the best question I can ask when all that is being offered are reasons why something can’t happen. </p>\n<p>It turns out, the answer to that question was, “if you got a tread mill, you could start walking every morning in the comfort of your own home.  You wouldn’t have to go outside when it is too hot or too cold.” </p>\n<p>I’ve also learned that walking every morning is a medically proven way to reduce the chances of getting cancer, reduce cholesterol, lower my resting heart rate, improve my confidence, improve brain function, reduce depression and help me sleep better. With all of those benefits, why wouldn’t I walk every morning? </p>\n<p>Prior to starting to walk every morning, I had already started to focus on my diet.  I’m not particularly over-weight.  I’m just over-weight for me.  So, I started on a high fat diet.  </p>\n<p>Lately, I’ve worked in MCT oil, some super food supplements as well as some magnesium oil, and reduced my caffeine intake to the first two hours of my day.  Between this and the walking, I actually have more time in my day and I don’t feel nearly as tired by the end of the work day as I had been. </p>\n<p>Now, the more I focus on my health, the more I want to focus on my health because I’ve found that most of the stuff holding me back from even starting were lies and half-truths.  Not to mention momentum and addictions to unhealthy foods. </p>\n<p>Here’s a super tip for anyone who is interested in this stuff.  Diet isn’t about will power.  If you are playing the will-power game, you are going to lose.  Your current life-style is formed on food addictions (with the help of food companies) emotions and occasionally the belief that you can’t afford to eat healthy.  The dirty little secret is, if you eat healthy and figure out what the emotional triggers are, the addictions practically take care of themselves.</p>\n<h2 id=\"Interviewing\"><a href=\"#Interviewing\" class=\"headerlink\" title=\"Interviewing\"></a>Interviewing</h2><p>I’ve been a contract programmer most of my career.  By definition, most of the places I’ve worked have been about a year and a half long and then I move on.  There are exceptions, but that is the general rule.  And let’s just say that my career has been nice and long.  So, you’d think at some point I would get used to interviewing and switching jobs. </p>\n<p>But I haven’t.  I’ve never liked new.  And, every job is new.  Every interview is new. </p>\n<p>I think the thing I dislike the most is that interviewing is a game that I don’t think anyone has figured out.  The strong temptation is to tell the person interviewing you what you think they want to hear.  I’ve found I do better if I tell them what I actually believe. If they don’t like the answer, I figure I probably wouldn’t be happy working there anyhow.</p>\n<p>And then there is the code interview.  I’ve talked about this several times on this blog before.  I still don’t think it is a good measure of what I can bring to an organization.  But, with all of the “programmers” who can’t do the simple stuff, I acknowledge they are probably necessary. </p>\n<p>Now, the problem with code interviews is that they are “test” constructed by other programmers, not by a professional testing organization.  This means that the first thing I have to figure out about the question is, “what are you really asking me?”  Also, you can never be quite sure what they are testing for.  Do they just want to see that you can solve the problem?  Do they have a particular implementation they are expecting from you?  Do they care about the answer at all and they are just using the code portion of the interview to weed out people who can’t code at all?  And if they are looking for a particular answer, how can they be so sure they have the “right” answer and that my answer is “wrong?”</p>\n<p>As an example, I was once asked how .NET memory management works.  The official answer is, “there is nothing in the .NET specification that says how it should work at all.”  But, the way it has been implemented in Windows is typically the answer people are looking for.  I’ve learned the best answer is the full answer.  Then again, why is this something anyone cares about.  Memory gets managed.  That should be all you really need to know. </p>\n<p>With all of these problems, why do I continue on? </p>\n<p>Well, as I’ve mentioned in other post, hopefully, I’ll learn something with each interview.  I’ll either learn something about myself, or I’ll learn some bit of programming that I still need to work on. </p>\n<p>And, the growth experience of doing something hard has benefit too.  If I avoid hard stuff, I learn that hard stuff is bad.  If I do hard stuff, I learn that hard stuff is just hard.  It won’t kill me.  Besides, I can’t even say what it is about new stuff that scares me.  It is just that feeling.  And I need to silence that lizard.  This is one reason why I believe in interviewing even if you have a job. </p>\n<p>I’ve worked with people in the past who won’t do code interviews.  They say things like, “I have thirty years of experience, if that’s not good enough for you, I don’t want to work for you.”  And I get it.  But I think secretly, they’re afraid of doing the interview.  I always ask, “why not just do the interview?  The worse that can happen is you don’t get the gig, and you might learn something in the process.”</p>\n<h2 id=\"Hiring-Managers\"><a href=\"#Hiring-Managers\" class=\"headerlink\" title=\"Hiring Managers\"></a>Hiring Managers</h2><p>I’ve hit this one at several levels.  Mostly I deal with recruiters.  Most of the recruiters I deal with are just looking for warm bodies.  Having dealt with them on both ends, as a person conducting interviews and as the one looking for work, I can tell you the market is saturated with the “any warm body” variety of recruiter. I’ve started filtering out the “any warm body” recruiters from my email and only work with recruiters that work with companies that are looking for programmers at a level above that.</p>\n<p>I hit this in full force this week when I did a phone interview with a lady who works for a company that has a pool of remote developers who work on their client’s programs.  So when we started talking about rate I found out that they pay everyone the same because it makes the math easier for the owner. I don’t know about you but that sounds short sighted at best and like slave labor at its worse.</p>\n<p>I’ve interviewed at other places where they seemed more concerned with what they would have me work on than IF they wanted to hire me. </p>\n<p>I get that the hiring process is difficult, and figuring out my worth might be difficult.  But, let’s take a look at this for a bit. </p>\n<p>Let’s just say you have 10 programmers who you pay $100K a year each.  You are interviewing someone who can demonstrate that they are twice as productive AND that they’ll be able to improve the productivity of everyone else you already have by at least 10% simply by being on your team, mentoring your existing staff, and implementing process improvements to your organization.  How much value does this 11th programmer possess?  Simple math would indicate at least $200K. </p>\n<p>So, fear holds us back, does it not?  All we hear is that this programmer is asking for a salary that is 1.5 times as much as what you’re paying everyone else and think, “I can’t afford that.”  The reality is, you probably can’t afford to NOT hire them. </p>\n<p>Imagine if you found a diamond mine in a field that was worth $1,000,000 and the land you found the mine in was being sold for $700,000 wouldn’t you find some way to buy the field? </p>\n<p>Maybe you don’t have $700,000.  And you think, “I can’t afford that.”  But isn’t a better question, “how can I afford that?”</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>So, my challenge this week is, “Don’t let fear hold you back.” </p>\n<p>Look for a way.  Stop listening to the whispers in your head telling you something can’t be done. </p>\n<p>Do something hard today and improve by 1%.</p>\n",
            "tags": [
                "interview",
                "health",
                "emotions",
                "hiring"
            ]
        }
    ]
}