{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"job search\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/secrets-to-your-first-programming-job/",
            "url": "http://davembush.github.com/secrets-to-your-first-programming-job/",
            "title": "Secrets to Your First Programming Job",
            "date_published": "2017-05-13T16:47:50.000Z",
            "content_html": "<p>This past week I was talking to a guy who is graduating from College and looking for a job. He asked me what most people ask at that point in their career. “Everyone wants experience, but how do you get experience if no one will give it to you?”</p>\n<p>What is interesting is that for all the advances in the 30 years since I started my career, that question is still the main question every graduate asks.</p>\n<p>Now, before I get started, I want to make sure we are clear. These tips may or may not work for you. They are what I would do, and in large part are what I did 30 years ago, just updated to be appropriate to the current technology. How well they work for you are going to depend on a lot of different factors, not least of which is how much effort you apply. They are also very much based on my culture here in the USA. If you are looking for a job in another country that is dissimilar culturally, you may want to ignore this advice completely. But, I’ll also say this. If what you are currently doing isn’t working, what do you have to lose?</p>\n<figure>![](/uploads/2017/05/2017-05-13.png)<figcaption>Photo credit: [MDGovpics](//www.flickr.com/photos/mdgovpics/8157677890/) via [Visualhunt.com](//visualhunt.com/re/abeb67) / [ CC BY](//creativecommons.org/licenses/by/2.0/)</figcaption></figure>\n\n<span id=\"more\"></span>\n\n\n<h2 id=\"Get-a-Job\"><a href=\"#Get-a-Job\" class=\"headerlink\" title=\"Get a Job\"></a>Get a Job</h2><p>Wait! Wasn’t the whole point of this article to help you find a job? No! The point of this article is help you get a Programming job. And the first step in the process is to get A job. Any job. Don’t be picky. When I started my career, I was working in the Sporting Goods and Automotive department at K-Mart. Minimum wage. Nothing to write home about. Prior to that I worked as a maintenance man.</p>\n<p>Listen, I know you want a job in whatever it was you went to school for. But the fact of the matter is, you have college bills to pay off. You probably have a car that needs gas and insurance. You may even have rent and groceries. If Mom and Dad are taking care of all that for you, shame on them! And shame on you for letting them, no matter how easy that makes life. Cut the cord and grow up!</p>\n<p>OK, enough on that rant. If I can’t convince you on the financial terms, let me try a couple other really good reasons.</p>\n<p>First, the fact of the matter is, no one wants to be the first one to take a chance on you.  If you don’t currently have a job that you’ve been able to hold for a while, how can I be sure that you will work out?  Even if you have all the credentials I’m looking for, will you stick around when things get hard?  Getting a job, particularly a crappy job, shows that you are a worker.  That nothing is beneath you.  And trust me, with all the stories about how millennials are lazy and want the world handed to them (even if that isn’t totally accurate) you can bet someone who is working for minimum wage at a job that don’t particularly like is going to stand out.</p>\n<h2 id=\"Your-Job-is-Getting-a-Job\"><a href=\"#Your-Job-is-Getting-a-Job\" class=\"headerlink\" title=\"Your Job is Getting a Job\"></a>Your Job is Getting a Job</h2><p>Until you have a job of some kind, your job is getting a job. The harder you work at getting a job, the faster you will get the job you want. This means you should have a list of things you can do today that will get you closer to landing a job.  Work on your resume. Implement some of the tips below. Apply for any and every job that is open.  Go door to door if you have to.</p>\n<p>Once you’ve finished reading this article, make a list and work through it.</p>\n<h2 id=\"It’s-a-Numbers-Game\"><a href=\"#It’s-a-Numbers-Game\" class=\"headerlink\" title=\"It’s a Numbers Game\"></a>It’s a Numbers Game</h2><p>Now here is a very sad truth. Getting that first job is a numbers game. You are going to apply to a lot of places before anyone hires you. And the thing your college won’t tell you as they prepare you to get out into the real world is just how much work this is going to be.</p>\n<p>When I was your age…</p>\n<p>…we just had the newspaper. I sent my resume to anyone and everyone that looked like they might have a programming job available.</p>\n<p>In your case, you are going to make sure you are as visible as possible. Post your resume on job boards. Apply to every company that has an open computer job, even if you don’t qualify for the one they advertised. Ask your friends if they know anyone who might be able to help.</p>\n<p>Note: I said, “might be able to help.” Not, “might be able to get you a job.” I’ll talk more about this later. But HOW you ask for help plays a HUGE part in being able to GET help.</p>\n<p>When someone ask you what you do, the answer is, “Well, actually, right now I’m trying to find a job as a ______ do you know anyone who might be able to help?”</p>\n<p>It is the whole networking thing.</p>\n<p>Allow me to tell you a story. When I graduated, this was the exact line I used. “Do you know anyone who might be able to help?” And when I contacted the person I was referred to, I asked the same question. Typically, the letter I sent looked something like this:</p>\n<blockquote>\n<p>Dear sir, I just graduated from such and such college&#x2F;university. My degree is in X and I’m trying to find work.</p>\n</blockquote>\n<blockquote>\n<p>I was speaking with John Doe who suggested that I contact you. I realize you may or may not have anything for me, but I was hoping you might be able to suggest some people who might be able to help me find an entry level programming position.</p>\n</blockquote>\n<blockquote>\n<p>Thanks for any help you can give me.</p>\n</blockquote>\n<h2 id=\"Your-Degree-isn’t-Primary\"><a href=\"#Your-Degree-isn’t-Primary\" class=\"headerlink\" title=\"Your Degree isn’t Primary\"></a>Your Degree isn’t Primary</h2><p>I know your degree is probably all you feel like you have. But mostly, no one cares. Oh, we care that you have a degree, but that is about all.</p>\n<p>What do we care about?</p>\n<p>What can you do?</p>\n<p>Now, what you need to do is think outside the box. When you put your resume together, you are going to put anything on your resume that is remotely related to the kind of job you are trying to get. Even if you did it for free.</p>\n<p>The next best thing you can do is to put something on your resume that indicates you are a go-getter. Did you have any leadership roles in college? Make sure that gets on your resume! Have you done a lot of volunteer work?</p>\n<h2 id=\"Dress-Up\"><a href=\"#Dress-Up\" class=\"headerlink\" title=\"Dress Up\"></a>Dress Up</h2><p>Really! This shouldn’t need to be said. But unless you are told otherwise ahead of time, you never get in trouble for dressing up for an interview. But nothing will kill it faster if you don’t. Yes, even in this modern day and age. Even if the organization sells itself as a casual organization, dress in business attire. Guys, this means where a suit. Gals, let’s face it, I doubt you’ll have any problem with this.</p>\n<h2 id=\"LinkedIn\"><a href=\"#LinkedIn\" class=\"headerlink\" title=\"LinkedIn\"></a>LinkedIn</h2><p>I wrote about <a href=\"/linkedin-tips-for-programmers/\">my LinkedIn strategy</a> a while ago.  As I stated there, the more connections you have, the better off you will be.  This is true of all social media.  Connect to anyone who ask to connect with you.</p>\n<p>Your LinkedIn connections are a large field of people you can send a version of the letter above.  Remember, you aren’t asking them for work, you are asking for help finding work.</p>\n<p>Which leads to a little rant I have built up about how to ask for help on LinkedIn.</p>\n<h2 id=\"Asking-for-Help\"><a href=\"#Asking-for-Help\" class=\"headerlink\" title=\"Asking for Help\"></a>Asking for Help</h2><p>This time of year, I get multiple in-Mails that all say essentially the same thing.  “Hi, I am graduating from X with a degree in Y.  Let me know if you have any work.”  Oh, yes, they use a few more words than that.  But the gist is exactly that short little sentence.</p>\n<p>Now, imagine you are me and everyone sends you that same in-Mail. What would you do? Probably the same thing I do. Delete it.</p>\n<p>Occasionally, I’ll get some sort of variation that amounts to exactly what I’ve been saying. “I was hoping I could talk to you about …” Why does this work when the other way doesn’t. Simple, you aren’t asking me for work. You are asking for advice.</p>\n<p>If you want to get help, you need to stand out.  If you ask me for advice and I have a job for you, I’ll let you know.  If all you do is ask for a job… “Delete”</p>\n<p>This, of course, doesn’t always work. But, this is exactly how I got my first job. Now, if you follow the advice I’ve given so far, eventually, you’ll find a job. But there is a lot more you can do that will make you stand out.</p>\n<h2 id=\"Volunteer\"><a href=\"#Volunteer\" class=\"headerlink\" title=\"Volunteer\"></a>Volunteer</h2><p>Hey, you aren’t doing anything yet anyhow.  If you took my advice and have a minimum wage job, you still have some brain power left.  So, find some organization that needs help with what you want to do and volunteer.  Now you have experience you can put on your resume and the organization has some program that helps them along.</p>\n<h2 id=\"Stack-Overflow\"><a href=\"#Stack-Overflow\" class=\"headerlink\" title=\"Stack Overflow\"></a>Stack Overflow</h2><p>Another place you can gain some points is on Stack Overflow.  Answer question.  The fastest way to learn is to find a question that no one has answered.  Figure out the answer and post it.  If you do one question a day, your points will rise and you can include a link to your profile as part of your resume.</p>\n<h2 id=\"Open-Source\"><a href=\"#Open-Source\" class=\"headerlink\" title=\"Open Source\"></a>Open Source</h2><p>Regardless of the type of work you want, participating in an Open Source project is another way of showing that you know your stuff. You might think you need to know a lot to participate in a project. But there are some low entry ways of participating.</p>\n<p>An easy way to get started is by visiting these sites and finding some low hanging fruit that will get you started:</p>\n<ul>\n<li><a href=\"//up-for-grabs.net/#/\">Up for Grabs</a> – A list of sites looks for help from new contributors.  Easy way to get started.</li>\n<li><a href=\"//github.com/MunGell/awesome-for-beginners\">Awesome for Beginners</a> – List of beginner friendly projects</li>\n<li><a href=\"//medium.freecodecamp.com/finding-your-first-open-source-project-or-bug-to-work-on-1712f651e5ba\">Check Out this Post</a> – Even more ways to get started</li>\n</ul>\n<h2 id=\"Your-Resume\"><a href=\"#Your-Resume\" class=\"headerlink\" title=\"Your Resume\"></a>Your Resume</h2><p>I wrote about <a href=\"/your-programming-resume-is-garbage/\">how I think a Resume should be put together</a> before.  Read it and implement it. Two things to remember:</p>\n<ul>\n<li>You need to stand out.</li>\n<li>The how-to class your college gave you is useless.</li>\n</ul>\n<h2 id=\"Job-Boards\"><a href=\"#Job-Boards\" class=\"headerlink\" title=\"Job Boards\"></a>Job Boards</h2><p>You can post your resume to all the job boards if you like.  But the only one I bother with is Dice.com because it is the only one I know of that is focused on what we do.</p>\n<h2 id=\"The-Interview\"><a href=\"#The-Interview\" class=\"headerlink\" title=\"The Interview\"></a>The Interview</h2><p>Once again, I’ve <a href=\"/categories/Interview/\">written about the interview process</a> before too.</p>\n<p>But here I want to talk to the new programmer specifically.</p>\n<p>First, no one expects you to have all the answers. If you don’t know, just say so. Don’t try to bluff you way through. They will find out you don’t know eventually. But more importantly, saying “I don’t know.” Means you really do know the stuff you’ve given an answer for.</p>\n<p>Second, while hardly anyone in this field wants to admit it, the interview is about interpersonal skills. A lot of the time, if you <a href=\"/confident-programmer-secrets-revealed/\">act confident in yourself</a>, they will be confident in you.</p>\n<p>Learn body language, power poses, etc.</p>\n<p>I was just thinking about this more today and realized … what’s the one thing most people want? They want to be liked. They want people to be interested in them. Sure, there are a lot of hacks I could tell you. But the simplest, and most genuine hack of all is to be interested in your interviewer.</p>\n<p>You know that part of the interview where they ask you if you have any questions? This is where you ask question that show you know something about the job you are interviewing for. But, you can also use this to ask a question that is both about the job and the person interviewing. Like, “What is your favorite part of working here?” and “What is your least favorite …” You find out something about the organization and you get them talking about something that is important to them.</p>\n<h2 id=\"Bet-on-Yourself\"><a href=\"#Bet-on-Yourself\" class=\"headerlink\" title=\"Bet on Yourself\"></a>Bet on Yourself</h2><p>As a last resort. Bet on yourself. “I’ll work for you for free for 3 months to prove to you that you want to hire me full-time.”  Even if things don’t work out, you’ve gotten more experience.</p>\n",
            "tags": [
                "interview",
                "job search"
            ]
        },
        {
            "id": "http://davembush.github.com/3-reasons-responding-to-useless-interview-questions-makes-you-happier/",
            "url": "http://davembush.github.com/3-reasons-responding-to-useless-interview-questions-makes-you-happier/",
            "title": "3 Reasons Responding To Useless Interview Questions Makes You Happier",
            "date_published": "2015-09-10T11:30:00.000Z",
            "content_html": "<p>I’ve noticed a trend recently.  Someone will write a post about some technical interview question and someone will write a comment about how that’s such a dumb question that they wouldn’t even bother answering it.  I’ve actually been that guy recently.  John Sonmez wrote about “<a href=\"//simpleprogrammer.com/2015/01/19/cracking-the-coding-interview/\">Cracking the Coding Interview</a>” and I responded that I don’t do coding interviews.  <a href=\"/cracking-the-programmers-interview-code/\">In fact, I wrote a whole post about this</a>.  But as John pointed out, this may actually cause you to be limiting your career.  You wouldn’t answer that question for a 33% raise?  Really?  There isn’t anything that could motivate you to consider answering a question that you feel is useless, stupid or dumb? This week, I saw another post about some technical interview question that someone said he wouldn’t answer.  Sorry, I don’t have a link for that one, I wish I did.</p>\n<p>And then add to this, the number of useless interview questions I have answered in the last year.  Why did I answer them?  Because I could.  Because the challenge was actually fun.</p>\n<p>And so, let’s reconsider the arrogant stance of “Thanks for your time, I’ll show myself out.” First let’s consider why we might not want to answer a particular question.</p>\n<p><img src=\"/uploads/2015/09/image1.png\" alt=\"image\" title=\"image\"></p>\n<span id=\"more\"></span>\n\n<h2 id=\"Telling-The-Truth-Makes-You-Happier\"><a href=\"#Telling-The-Truth-Makes-You-Happier\" class=\"headerlink\" title=\"Telling The Truth Makes You Happier.\"></a>Telling The Truth Makes You Happier.</h2><p>As I said, I’ve answered a lot of useless questions.  Most recently, I was asked about how garbage collection works in .NET.  When is the last time anyone needed to know that?  Isn’t the whole point of .NET that memory management gets handled for you?  Someone else may have refused to answer the question.  Why?  Because we don’t think we can.</p>\n<p>The reason I don’t like code interviews is because 1) I’ve never had to do one and 2) I’m afraid I won’t be able to do it.</p>\n<p>Dumb reason! The post I mentioned earlier that I don’t have a link for was something about how linked lists worked.  Or sorting.  Why did he consider it an issue?  Maybe because he didn’t feel like he could answer it? Let’s face it, most of use, rather than admitting we don’t know something, would just rather deflect the problem to the person asking the question.</p>\n<p>And so, the first way that just answering the question will make you happier is that telling the truth makes you happier.</p>\n<p>The more honest we are with ourselves and with others, <a href=\"//www.smh.com.au/lifestyle/life/time-to-come-clean-little-white-lies-found-to-be-a-health-hazard-20120805-23o0t.html\">the happier we are</a>.</p>\n<p>So, rather than taking the stance of “I won’t answer that question”, why not prepare yourself so that you CAN answer the question? And this leads to my second reason…</p>\n<h2 id=\"You-Will-Gain-Confidence\"><a href=\"#You-Will-Gain-Confidence\" class=\"headerlink\" title=\"You Will Gain Confidence\"></a>You Will Gain Confidence</h2><p>How’s that?  Well, let’s say you answer the question, the first time, the best way that you know how but you know you were pretty shaky.  So, you go home, and look up the answer.  The next time you get asked the question, you are better prepared.  You’ve learned something along the way and are now more confident.  Or, you may find out that the question wasn’t all that important given all you were able to answer.</p>\n<p>I’ll tell you a little insider secret.  If you really know your stuff, you’ll probably get the job anyhow.  The interviewer is just trying to figure out how much you know.  If you’ve gotten to the point where they are asking one of these seemingly irrelevant questions, you’ve probably already got the job.</p>\n<p>Most people can’t even answer the basic questions I’ve previously blogged about:</p>\n<ul>\n<li><a href=\"/7-c-interview-questions-that-weed-out-the-losers/\">Basic C# Questions</a></li>\n<li><a href=\"/7-javascript-interview-questions-to-weed-out-imposters/\">Basic JavaScript Questions</a></li>\n</ul>\n<p>I know of at least two places that have interviewed 10 people just to find one that would be OK.  Knowing this, alone, has given me a lot more confidence when I interview.</p>\n<p>But as people have mentioned on those post, just because they can answer the questions, doesn’t mean they can code.  We have to have other questions we can ask you to get at that.</p>\n<p>I’ve been in two interviews, that I can remember that did this well.  One was for a position that was mostly JavaScript.  In fact, he never asked me anything about C#.  What he said was something like, “I know nothing about JavaScript, tell me about JavaScript.”  And then he stopped talking and listened to me.  Every once in a while he would say, “Tell me more about that.”  That was the entire interview.</p>\n<p>A couple of weeks ago, I was asked to talk about my experience with ASP.NET’s MVC.</p>\n<p>A question that was just as open ended.  The guy’s boss, who was the hiring manager, questioned the open endedness of the question.  The response was, “I want to know if he’s worked with it before.  If he has, he should be able to answer that question.” Interestingly, there were no JavaScript questions this time.</p>\n<h2 id=\"You-Might-Get-Your-Dream-Job\"><a href=\"#You-Might-Get-Your-Dream-Job\" class=\"headerlink\" title=\"You Might Get Your Dream Job\"></a>You Might Get Your Dream Job</h2><p>Listen!  You decided to interview, I assume, because you wanted this job, or at least thought you might want this job.  You’re going to walk out of an interview and make yourself look like an ass simply because you don’t like the question?  Who is being dumb now?! Like I said, it is so hard to find good talent, that if they are asking hard questions, you’ve probably already got the job anyhow.  But if you walk out, not only do you not have the job, but you’ll never get a second chance to interview with the people in the room again, and that includes when they show up at other companies.  Think that’s not true?  I know I keep a mental list of people I might want to consider in the future.  Both people I’ve worked with and people I’ve interviewed.</p>\n<p>So take your best stab at the question.  There have been a number of times when my answer has been, I don’t know, but here is how I’d find out when I needed it.  Often the “how I’d get the information answer” is better than actually being able to answer the question.</p>\n<p>So, dare to answer the questions.  The results might surprise you.</p>\n",
            "tags": [
                "interview",
                "job search"
            ]
        }
    ]
}