{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"quality\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/the-proper-function-of-qa/",
            "url": "http://davembush.github.com/the-proper-function-of-qa/",
            "title": "The Proper Function of QA",
            "date_published": "2014-05-01T17:18:00.000Z",
            "content_html": "<p><img src=\"/uploads/2014/04/QA.png\" alt=\"QA\" title=\"QA\"> With all this talk of test driven development, one has to naturally ask, “Where does the QA department fit in?  Do they even have a role in the organization any more?” Well, the answer to that is, “absolutely but probably not the role they think they have.”</p>\n<span id=\"more\"></span>\n\n<h2 id=\"QA-People-Are-Not-Programmers\"><a href=\"#QA-People-Are-Not-Programmers\" class=\"headerlink\" title=\"QA People Are Not Programmers\"></a>QA People Are Not Programmers</h2><p>Once again, as I visit organizations, I find that they are trying to use automated testing tools to script their test.  This ends up being a fool’s errand because most QA people are not programmers and to create a script that is actually going to work reliably, that is going to take a programmer.</p>\n<h2 id=\"Jr-Programmers-Are-Not-QA-People\"><a href=\"#Jr-Programmers-Are-Not-QA-People\" class=\"headerlink\" title=\"Jr Programmers Are Not QA People\"></a>Jr Programmers Are Not QA People</h2><p>The other related problem I frequently see is that organizations tend to put junior programmers in the QA department to handle this “trivial programming task” when what they really ought to be doing is placing senior level programmers in the department because they are more likely to be able to predict what could go wrong.  But I digress.</p>\n<p>By moving to a test driven development process, you actually end up solving the problem of QA needing programmers because you’ve moved the creation of the scripts away from the QA department and back on to the programming staff where it belongs.</p>\n<p>So what is the point of having a QA department if they are no longer going to create test scripts?</p>\n<h2 id=\"The-Proper-Role-of-QA\"><a href=\"#The-Proper-Role-of-QA\" class=\"headerlink\" title=\"The Proper Role of QA\"></a>The Proper Role of QA</h2><p>They have the same function they’ve always had.  Their job is to try to break the program.  To find all of the conditions the programmers left out when they wrote the code and to report those problems back to the programming staff where they can write a test for the problem and fix the bug.</p>\n<p>This may sound like a job that anyone can do, but remember that once they’ve broken the program they have to document how they broke it in a way they can repeat so that when the problem is reported to the programming staff, the error is easy to find.  This requires an attention to detail that few people have.</p>\n",
            "tags": [
                "roles",
                "QA",
                "Quality"
            ]
        }
    ]
}