{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"habits\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/changing-habits/",
            "url": "http://davembush.github.com/changing-habits/",
            "title": "Changing Habits",
            "date_published": "2015-03-19T10:00:00.000Z",
            "content_html": "<p><img src=\"/uploads/2015/03/hand-039.jpg\" alt=\"hand-039\" title=\"hand-039\">This past week I’ve been thinking a lot about changing habits and how much of our lives habits influence. To be clear, I would define a habit as something we have learned to do as an automated response to some trigger.  Something we no longer think about doing, but we just do because … well … because we’ve always done it that way.</p>\n<p>I have some bad habits:</p>\n<ul>\n<li>Eat something sweet when I’m tired or bored.</li>\n<li>How I react to particular situations</li>\n<li>… others I’m not so willing to share publicly …  :)</li>\n</ul>\n<p>And some good habits:</p>\n<ul>\n<li>Wake up before 4:40am</li>\n<li>Go to bed at 9:00pm</li>\n<li>Write a blog post once a week</li>\n<li>Watch PluralSight videos for 30 minutes every day.</li>\n</ul>\n<p>And some habits I’m trying to form:</p>\n<ul>\n<li>Exercise every day</li>\n<li>Take my vitamins</li>\n<li>Work on my book for 30 minutes each day</li>\n</ul>\n<span id=\"more\"></span>\n\n<h2 id=\"How-I-Deal-With-Habits\"><a href=\"#How-I-Deal-With-Habits\" class=\"headerlink\" title=\"How I Deal With Habits\"></a>How I Deal With Habits</h2><p>Now, I’ve learned that the best way to conquer bad habits is to replace them with good habits.  So, for example, since I believe that fat is better than sugar, I might decide to eat cheese rather than cookies when I’m bored.</p>\n<p>I’ve also learned that if I can set an alarm, I’m more likely to do something.  In fact, my life is run from my calendar on my phone.  If you want me to do something for you, the best way to make sure I do it is to make sure I’ve scheduled it.  I’m kind of obsessive about keeping appointments, so this works well for me.</p>\n<p>The other thing that works well for me is doing something at the same time every day, or every week.  So, I write blog post, pay bills, do household chores and prepare for a Bible study that I run on Saturdays.  I watch <a href=\"/pluralsight\">PluralSight</a> videos and work on the book that I’m writing first thing every morning.  I take my vitamins at the same time each day.</p>\n<p>It is the routine that helps maintain the habit.</p>\n<h2 id=\"Start-Small\"><a href=\"#Start-Small\" class=\"headerlink\" title=\"Start Small\"></a>Start Small</h2><p>I often end up coaching people who want to start some new habit.  Maybe you’ve been reading my blog and you’ve been challenged to start implementing <a href=\"/categories/TDD/\">Test Driven Development</a>.  What I find is that people want to start at the end.  So, let’s say you want to run 3 miles every day.  If you start out the first day and run three miles, I can pretty much assure you that you’ll give up right away.  No, what we need to do is something much smaller.</p>\n<p>I started exercising a couple of years ago, I realized that if exercising required me to go to a gym, I was never even going to get started.  The question I often ask people is, “What CAN you do?”  So I asked myself that question.  The answer came back, “I can do one exercise every hour and a half during the day.</p>\n<p>Then I started working outside of the house and the change in routine slowly eroded my ability to exercise.  So once again, I asked myself, “what CAN you do?”  I can do one exercise every morning.  Once I’ve established that habit, I plan on increasing to two exercises.</p>\n<p>So, if you want to start with TDD, probably the best way to start is to write a test.  One test.  Maybe commit to writing one test a day.  Think about it, if you are afraid that TDD won’t be accepted in your organization, who’s going to complain about one little test?  Or maybe better, just commit to a half hour of writing tests every day.  This allows you to get started without taking the huge time commitment learning TDD properly would take, which is probably what is keeping you from starting in the first place.  Start today.  Start now.  In a year, see if it hasn’t become how you develop code.</p>\n<p>What I’m still working on are ways that I react to situations.  These are a bit trickier to change because most of my responses are what people would called “learned responses.”  What I need to figure out is, 1) where did I learn these responses, 2) why did I learn them and 3) do the responses still make sense?</p>\n<h2 id=\"Better-Than-Before\"><a href=\"#Better-Than-Before\" class=\"headerlink\" title=\"Better Than Before\"></a>Better Than Before</h2><p>A couple of resources caught my eye this week that I think you might be interested in if you are interested in killing bad habits or starting a new one.</p>\n<p>The first is a new book by Gretchen Rubin called, <a href=\"/betterThanBefore\">Better Than Before: Mastering the Habits of Our Everyday Lives</a><img src=\"//ir-na.amazon-adsystem.com/e/ir?t=davmbusnetapp-20&l=as2&o=1&a=0385348614\">which will be out by the time this post goes live (I write these blog post well in advance of when you actually see them).</p>\n<p>What I’ve found particularly interesting is that Gretchen has developed a framework for how to determine how people respond to expectations, and <a href=\"//www.gretchenrubin.com/happiness_project/2014/03/quiz-are-you-an-upholder-a-questioner-a-rebel-or-an-obliger/\">you can take a test to find out how you respond to expectations</a>.</p>\n<ul>\n<li>Upholders: respond readily to outer and inner expectations.</li>\n<li>Questioners: question all expectations; they’ll meet an expectation <em>if</em> they think it makes sense; essentially, they make all expectations into inner expectations</li>\n<li>Obligers: meet outer expectations, but struggle to meet expectations they impose on themselves</li>\n<li>Rebels: resist all expectations</li>\n</ul>\n<p>Gretchen says, if you don’t want to take the test, you are probably a rebel, so don’t worry about it ;).</p>\n<p>Anyhow, I’m looking forward to reading the book when it comes out.</p>\n<p>I came out as an upholder, which is no real big surprise.  There are areas of my life that are HEAVILY influenced by what I think people expect of me, and I tend to question new expectations that are imposed on me.</p>\n<p>And yet, I still have trouble trying to implement new habits in my life.</p>\n<h2 id=\"Coach-ME\"><a href=\"#Coach-ME\" class=\"headerlink\" title=\"Coach ME\"></a>Coach ME</h2><p>This brings me to my second resource.  I’ve known about this one for a while, but I’ve just recently really started using it.</p>\n<p><a href=\"https://coach.me/\">Coach.me</a> is an app for iPhone and Android that allows you to use the power of community and accountability to help you establish your habits and achieve your goals.  If you want, or need, there is also  coaching that you can pay for if you want or need a little extra help.</p>\n<p>Right now, I’m just using the alarm and check-in feature.  Somehow being able to open the app and check the box that says I finished a particular activity is enough encouragement for me to not blow it off.  It probably helps that if I don’t check it off, I’ll forever have a hole in my calendar forever saying, “Yo!  you missed a day.” At some point, I may actually use one of the coaches.  I keep looking, but I haven’t found anyone that looks like someone I can relate to.  Or, maybe I just need to grow out of my 3 year old self that wants to do everything on my own.  That’s another area I’m working on.</p>\n",
            "tags": [
                "tdd",
                "habits"
            ]
        }
    ]
}