{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"education\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/do-programmers-even-need-a-degree/",
            "url": "http://davembush.github.com/do-programmers-even-need-a-degree/",
            "title": "Do Programmers even NEED a degree?",
            "date_published": "2013-09-11T15:32:04.000Z",
            "content_html": "<p>Well, a post that is no longer available really got  things going in blog-o-sphere.  Shoot!  Even <a href=\"//www.joelonsoftware.com/items/2008/01/08.html\">Joel Spolsky</a> got involved.  I saw another post, but I’m sorry to say, I can’t find it right now.</p>\n<p>The original article put forth the idea that we are teaching the right stuff in our undergraduate Computer science degree programs.</p>\n<span id=\"more\"></span>\n\n<p>Joel’s article suggested that what we really need is a bachelor of fine arts program for programmers.  That programming, and computer science are really two entirely different disciplines.</p>\n<p>I think Joel’s onto something and his solution is probably the closest to what our current educational system can handle.  But, I have another solution to the problem that goes further.</p>\n<p>Why get a degree at all.  Most of you reading this post know as well as I do that a good 80% of what most programmers learn, they didn’t learn from college.  Let’s face reality here.  First, any degree program is, at best, 20 years behind.  It’s just a fact.  Ours is not the only industry facing this reality.  Second, the really good programmers are already doing what these schools are trying to teach.</p>\n<p>Joel suggest that we have people from the industry come in and teach this BA course work he’s suggesting.  There are several major problem with this.  First, most (not all) of the really good programmers can’t teach.  Some could with some training, but the school isn’t going to train them.  And those who can teach, probably don’t know the recent material.  There ARE exceptions.  My point here is that the exceptions won’t fill the need.</p>\n<p>But, what would happen if we went back to a really old way of doing things?  It worked.  We are almost doing some form of this already, mostly after graduation.  What if we just skipped the programming degree completely.</p>\n<p>I’ve been in this field long enough (20+ years) to know that most of the really good programmers got into our field through some back door.  I was a camp and recreation major that converted to programming via DePaul’s career change program.  A hoop I jumped through simply so I could get the first job.  At least 80% of what I was taught I was already doing as I had experimented with Basic, Pascal, and C.</p>\n<p>I know another guy who dropped out of school his sophomore year because he already had the job he was going to school to get.</p>\n<p>And don’t even get me started on certifications.  Let’s say we stop testing knowledge and start testing aptitude.  The aptitude test I took nearly knocked me out of the DuPaul program.  At the end of the program, the main prof told me I was the best natural talent he’d seen come through the program.  I wonder if he knows he almost never saw me?</p>\n<p>Let’s face it, what we as programmers need to know to do our jobs effectively can’t be taught.  And most of what can be taught could be taught on the job.</p>\n<p>So, here’s my recommendation.  Why don’t we go back to using the apprentice system?  This allows a good senior programmer to get a feel for what kind of programmer the new guy is going to be.  It would help the new programmer find out really quickly if this is what he really wants to do with his life.  He gives the formal training the new programmer needs.</p>\n<p>Unless you’re just starting out, you know that most of what you learn, you learn from experience.  Why not just admit that and stop trying to fit programming into a degreed program that largely doesn’t work for our industry?</p>\n",
            "tags": [
                "programming",
                "education"
            ]
        },
        {
            "id": "http://davembush.github.com/why-programmers-can%E2%80%99t-program/",
            "url": "http://davembush.github.com/why-programmers-can%E2%80%99t-program/",
            "title": "Why Programmers Can’t Program",
            "date_published": "2010-03-11T12:53:24.000Z",
            "content_html": "<p><img src=\"/uploads/2010/03/WEST0241.png\" alt=\"WEST0241\" title=\"WEST0241\"> Jeff Atwood of <a href=\"//www.codinghorror.com/blog/2010/02/the-nonprogramming-programmer.html\">Coding Horror</a> writes:</p>\n<p>“I find it difficult to believe, but the reports keep pouring in via Twitter and email: **many candidates who show up for programming job interviews can’t program. At all.**”</p>\n<span id=\"more\"></span>\n\n<p>Jeff, you must not have visited a college campus recently.  The reason most that most “programmers” can’t program is because their instructors led them to believe they could program.</p>\n<p>I have two stories that illustrate the point.</p>\n<p>I do work for a local community college.  The college hired one of their students to work on an ASP.NET project because he was recommended by the professor and because he got all A’s in his programming classes.  The professor told the manager, “this is one of the best students I’ve ever had.”</p>\n<p>Maybe he was the best if you evaluate by his grades, but he sure couldn’t program.  And even if he were to read this, or one of his buddies were to read this and show it to him, I think he’d agree.  He eventually quit and went back to doing what he used to do before he learned how to be a programmer.</p>\n<p>To the school’s credit, they did actually teach current languages.  But that’s where the education stopped.  They taught various programming languages like most of us learned math.  Here’s the formula.  Here’s an exercise that uses the formula.  Nothing in the classes require the student to solve a real-life problem, or even to solve any of the interview problems.</p>\n<p>At the school my daughter goes to, I found the situation even worse.  They have a computer science program but as I was talking to a recent graduate I found out there was no way I’d hire this kid.  I found out because the kid knew he’d been cheated and was freely telling me about it.  So just to find out how bad things were I asked a few questions.</p>\n<p>Turns out, he’d been educated in Java, but he couldn’t tell me what polymorphism was, or when I asked it as, “what is inheritance and how would you use it practically?”  he couldn’t tell me.</p>\n<p>He’d never seen JSP, HTML, or JavaScript either.  What school teaches Java and doesn’t teach those subjects with it?</p>\n<p>One of the commenters suggests that we need government-regulated tests (like that would work any better than any other government-regulated test?)  to help weed out those who can’t program.  While I’m sure there are some great examples of teachers who can program, can teach programming, and care about the quality of programmers they are graduating, I’d suggest changing the education system to weed out the professors who can’t teach, can’t program, and don’t care.  Maybe the certification tests need to go higher than the students we end up interviewing.</p>\n",
            "tags": [
                "programming",
                "education",
                "college"
            ]
        }
    ]
}