{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"listview\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/converting-a-datalist-to-a-listview/",
            "url": "http://davembush.github.com/converting-a-datalist-to-a-listview/",
            "title": "Converting a DataList to a ListView",
            "date_published": "2013-12-26T01:15:26.000Z",
            "content_html": "<p>Yesterday, I spent the bulk of the day converting a DataList to a ListView.  I thought I’d spend a little time relating the process for those of you who might be interested in doing the same.</p>\n<span id=\"more\"></span>\n\n<p>For the most part, the transition went smoothly.</p>\n<p>The first thing I looked at was the structure of the two sets of tags.  It was pretty quickly apparent that I was not going to be able to just change the tag name.  Not that I expected I could, but it would have been a nice bonus. </p>\n<p>What I did notice as I inspected the structure was that both sets have an ItemTemplate tag.  So I create a new ListView control pointing at the data I want it to display, and then I moved the itemTemplate tag from the DataList into the new ListView.</p>\n<p>Bad move.  But, since I’ve already suffered the pain, it won’t be so bad for you.  The basic problem stems from the fact that the ListView itemTemplate expects to start and end with a pair of TD tags.  In the DataList’s itemTemplate tag, you can put anything you want.  So, what you should do is copy the contents of the itemTemplate tag in the DataList into the the ListView’s itemTemplate tag and then put the TD tags around the content you just pasted, and inside the itemTemplate tags.</p>\n<p>Not so bad once you figure it out, but if you start this process after a full day of programming, this can be just a bit frustrating.</p>\n",
            "tags": [
                "asp.net",
                "datalist",
                "listview"
            ]
        }
    ]
}