{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"react\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/rethinking-action-names-redux-ngrx/",
            "url": "http://davembush.github.com/rethinking-action-names-redux-ngrx/",
            "title": "Rethinking Action Names (Redux/NgRX)",
            "date_published": "2021-05-29T10:52:47.000Z",
            "content_html": "<p>If you’ve been using some form of Redux, you are familiar with the basic flow of data through the Redux loop. Central to this flow are Actions, the messages that trigger code in our Reducer or Effect&#x2F;Epic&#x2F;Saga (depending on what flavor of Redux you are using).</p>\n<p>The model allows us to disconnect our code so that it only cares that an action was triggered in some way.  That is, “when this action occurs, I will run this code.”</p>\n<p>Because of this, we can create an action that triggers multiple code blocks to run. Our only concern is that the code that gets triggered can’t depend on each other.</p>\n<p>In fact, much of the official literature encourages this practice.</p>\n<p>And, this is where all our troubles begin.</p>\n<span id=\"more\"></span>\n\n<h2 id=\"Current-Recommendation\"><a href=\"#Current-Recommendation\" class=\"headerlink\" title=\"Current Recommendation\"></a>Current Recommendation</h2><p>You see, the official literature around actions also suggest a naming convention that is tied to what we want to happen, rather than what just happened or something otherwise more generic.</p>\n<p>For example, take the simple act of loading a list of employees from the server. To do this, we would typically create two actions.  The first would be <code>LoadEmployees</code> and the second would be <code>LoadEmployeeResults</code>. Both of these actions represent what we want to do, not what just happened.</p>\n<p>Now, let’s say we also want to display some sort of wait state and that we want to control it using Redux.  For that we would create a Reducer in our store.  Let’s call it <code>Wait</code>. And for the purposes of this post, we will assume that <code>Wait</code> tracks wait state by incrementing and decrementing a counter.</p>\n<p>But, we don’t need to create new Actions for our Wait state because we can re-use the actions we’ve already created. When we fire <code>LoadEmployees</code> we can increment <code>Wait</code> and when we fire <code>LoadEmployeesResult</code> we can decrement the load.</p>\n<h2 id=\"What’s-Wrong-With-That\"><a href=\"#What’s-Wrong-With-That\" class=\"headerlink\" title=\"What’s Wrong With That?\"></a>What’s Wrong With That?</h2><p>Do you see the problem here? We now have a reducer responding to an event that is not obviously tied to an action that has anything to do with the code that is getting executed. <code>Wait</code> is not a <code>LoadEmployees</code> thing although, you might reasonably say it is a <code>Load</code> thing.</p>\n<p>And so how might we think about restructuring our code so that this makes more sense.</p>\n<h2 id=\"A-Change-In-Perspective\"><a href=\"#A-Change-In-Perspective\" class=\"headerlink\" title=\"A Change In Perspective\"></a>A Change In Perspective</h2><p>What if instead of naming actions what we wanted to do, we named them something more along the lines of what just happened.  That would make our <code>LoadEmployees</code> action <code>NeedEmployees</code> and our <code>LoadEmployeesResult</code> action, <code>EmployeesLoaded</code>.</p>\n<p>Even these names don’t get at the fact that Needing Employees doesn’t mean we need to increment the wait state.</p>\n<h2 id=\"Rethinking-The-Problem\"><a href=\"#Rethinking-The-Problem\" class=\"headerlink\" title=\"Rethinking The Problem\"></a>Rethinking The Problem</h2><p>One way we can think about this problem is to look at other messaging systems, like the windows messaging system. It’s been a while since I’ve used the raw messages in Windows but I seem to recall a <code>WM_BUTTON</code> or <code>WM_BUTTON_CLICK</code> message that would get passed to my application when a button was clicked.  One message for every button in my system that had, as part of the payload, what button was clicked so my code could listen for that message for that button and do something because of it.</p>\n<p>We could do something similar with the code above. Instead of tying the actions to particular code we want to run, our actions could be more generic.<br>What if we had two generic messages, <code>Load</code> and <code>LoadResult</code>. The payload for these messages could then have a <code>LoadType</code> property that defined WHAT we were loading so that we could Load Employees, Addresses, and Phone Numbers all using the same two actions and we could also use <code>Load</code> and <code>LoadResult</code> to increment and decrement our wait state.</p>\n<p>This would work except we still have a problem.</p>\n<h2 id=\"That’s-Not-How-It-Was-Designed\"><a href=\"#That’s-Not-How-It-Was-Designed\" class=\"headerlink\" title=\"That’s Not How It Was Designed\"></a>That’s Not How It Was Designed</h2><p>Most of the tools we currently have in place to reduce the boiler plate code we need to write are based on a one-to-one relationship between actions and the code that gets run. This isn’t to say that we couldn’t adapt them but doing so would be more trouble than it is worth because we would be working against the intended design.</p>\n<p>And so, I would suggest to you that the advice the current literature gives us about using Actions to trigger multiple blocks of code is wrong. Since Actions are primarily used as loosely coupled method calls, using them in unrelated places violates the Single Responsibility Principle and makes the code hard to follow.</p>\n<p>I’ve seen one code base where the code that gets triggered has absolutely nothing to do with the Action that triggers it. Not something in the simple case of LoadEmployee triggering Wait, but in more obscure relationship like <code>LoadCandyBars</code> triggering <code>LoadSteakDinner</code>.  The result is that the code becomes extremely difficult to follow. This is one of the biggest causes of bugs in this system.</p>\n<h2 id=\"Maybe-This-Will-Work\"><a href=\"#Maybe-This-Will-Work\" class=\"headerlink\" title=\"Maybe This Will Work\"></a>Maybe This Will Work</h2><p>For our discussion about the Wait state, I would suggest that we create a separate set of Actions for our Wait state, possibly WaitStart() and WaitEnd() that get fired when we fire EmployeeLoad() and EmployeeLoadResult(). You could wrap these calls in a function or method to ensure they always get called together, but the actions themselves need to be unique to make the code easier to follow.</p>\n<p>Currently, this is my recommended implementation. While not ideal, it gets the job done and makes maintaining the code simple and straight forward even if I do have to duplicate more Actions that I would like to.</p>\n",
            "tags": [
                "angular",
                "react",
                "ngrx",
                "redux"
            ]
        }
    ]
}