{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"dom\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/amazing-angular2-dom-tips-tricks-and-warnings/",
            "url": "http://davembush.github.com/amazing-angular2-dom-tips-tricks-and-warnings/",
            "title": "Amazing Angular2 DOM Tips, Tricks, and Warnings",
            "date_published": "2017-01-17T12:30:00.000Z",
            "content_html": "<p>I’ve been working with Angular2 now since RC0 and I’ve learned quite a few things about Angular2 DOM tips, tricks, and warnings that you’ll want to pay attention to as you get started.</p>\n<figure>![](/uploads/2017/01/image.png \"Amazing Angular2 DOM Tips, Tricks and Warnings\")<figcaption>Photo credit: [Sister72](//www.flickr.com/photos/sis/196867770/) via [VisualHunt](//visualhunt.com) / [CC BY](//creativecommons.org/licenses/by/2.0/)</figcaption></figure>\n\n<span id=\"more\"></span>\n\n<h2 id=\"Avoid-DOM-Manipulation\"><a href=\"#Avoid-DOM-Manipulation\" class=\"headerlink\" title=\"Avoid DOM Manipulation\"></a>Avoid DOM Manipulation</h2><p>One of the first things you need to understand about how Angular2 works compared to AngularJS is that any DOM manipulation you do using Angular2 isn’t really manipulating the DOM. At least not directly. Everything that happens at the DOM level is a result of a state change in the component. When Angular2 realizes that the state has changed, it changes the DOM to reflect the change.</p>\n<p>What this means, generally, is that if you need to know about some state change that happened at the DOM level, you’ll want to track that change in your component class. Can you access the DOM directly from your code? Yes. And sometimes you might just have to. But you’ll produce code that is much easier to test if you avoid having your code reach up into the DOM to get current state information.</p>\n<p>You may have already heard about the experimental Web Workers support in Angular2. To make sure you can use this, it would be best to avoid direct DOM manipulation until we are sure the Web Workers implementation will be able to deal with this properly. What this all means in practical terms is that you’ll want to avoid using libraries such as jQuery to manipulate your code and instead replicate that behavior using native Angular2 calls.</p>\n<h2 id=\"Only-Generate-the-HTML-You-Need\"><a href=\"#Only-Generate-the-HTML-You-Need\" class=\"headerlink\" title=\"Only Generate the HTML You Need\"></a>Only Generate the HTML You Need</h2><p>On a similar note, you only want to render the HTML you’re going to need at any one time. Not everything all at once. This will allow your code to render much more efficiently.</p>\n<p>For example, if you have a menu that has dropdown menus, the temptation is going to be to render all the HTML the menu may need all at once and use JavaScript to show or hide the dropdowns as you mouse over them or click them. But with Angular2, you could use the *ngIf directive to include and exclude the menu option as you need them to show. This reduces the initial page size and simplifies your code. Been there, done that.</p>\n<p>By the way, there are other directives you’ll want to get familiar with, but *ngIf is probably the most often ignored because you are likely to try to use display:none to hide an element instead of just eliminating it from the DOM completely.</p>\n<h2 id=\"Minimize-Change-Detection\"><a href=\"#Minimize-Change-Detection\" class=\"headerlink\" title=\"Minimize Change Detection\"></a>Minimize Change Detection</h2><p>I was recently working on a component that displayed a nested array as a set of tabs and dropdown menus. Everything was working great but I wanted to check the CSS on the dropdown so I could make some adjustments. This is when I discovered that the HTML was being rewritten about once a second even though nothing had changed. I couldn’t see this on the main screen, but it became super evident when I opened the developer tools.</p>\n<p>Fortunately, I had already learned about OnPush change detection. So I was able to set my component to use Push notification:</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">@Component(&#123;</span><br><span class=\"line\">    templateUrl: <span class=\"string\">&#x27;template.html&#x27;</span>,</span><br><span class=\"line\">    changeDetection: ChangeDetectionStrategy.OnPush <span class=\"comment\">// &lt;===</span></span><br><span class=\"line\">&#125;)</span><br><span class=\"line\">export <span class=\"keyword\">class</span> <span class=\"title\">View</span> ...</span><br></pre></td></tr></table></figure>\n\n<p>And now the component only re-renders when the data it is looking at changes.</p>\n<p>For Push notification to work correctly, all the data that the component is looking at has to be <a href=\"/what-if-everything-was-immutable/\">immutable</a> or an <a href=\"/reasons-to-use-rxjs-today/\">Observable</a>. These are both patterns you should become familiar with because any well architected Angular2 application will make significant use of both of these.</p>\n<h2 id=\"Accessing-the-Component-Container\"><a href=\"#Accessing-the-Component-Container\" class=\"headerlink\" title=\"Accessing the Component Container\"></a>Accessing the Component Container</h2><p>Another problem I recently had was that I wanted to use the class attributes from the container on a child component. The question I had trouble getting the answer to was, “just how to I access the container element?” This was very easy. It is always easy once you know the secret handshake.</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">this</span>.elementRef</span><br></pre></td></tr></table></figure>\n\n<p>There are various properties and methods hanging off that which might be useful to you. In my case, I wanted to go after the classes that had been attached and reattach them to the INPUT element that was a child of the component. So, I needed to use:</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"keyword\">this</span>.elementRef.nativeElement.classList</span><br></pre></td></tr></table></figure>\n\n<h2 id=\"Accessing-Child-Elements\"><a href=\"#Accessing-Child-Elements\" class=\"headerlink\" title=\"Accessing Child Elements\"></a>Accessing Child Elements</h2><p>Similarly, you might want to access child elements from your code. This is much easier to find when you search the Internet.</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">@ViewChild(<span class=\"string\">&#x27;input&#x27;</span>) input: ElementRef;</span><br></pre></td></tr></table></figure>\n\n<p>@ViewChild is an attribute that tells the Angular2 compiler to look for an element in the template with the variable named input. I’ll explain template variables in a bit. In the code above, I’m going after the INPUT element with a template variable named “input” so I typed it as ElementRef since I don’t have a specific class name for it.</p>\n<p>If you only have one unique element, you can just use code that looks more like this:</p>\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">@ViewChild(ElementClassName) variableName: ElementClassName;</span><br></pre></td></tr></table></figure>\n\n<p>Of course, you’ll want to make sure you imported <code>ElementClassName</code> for this to work. In this case, I’m going after a specific type of element so I type the variable as that type. Now my typescript code knows what properties, fields, and methods I have available.</p>\n<h2 id=\"Template-Variables\"><a href=\"#Template-Variables\" class=\"headerlink\" title=\"Template Variables\"></a>Template Variables</h2><p>As I mentioned above, you can create template variables to allow you to access your child elements from your typescript code. But you can use them for other purposes as well. To create a template variable, just put a hash in front of the variable name you want to use.</p>\n<figure class=\"highlight html\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"tag\">&lt;<span class=\"name\">input</span> #<span class=\"attr\">firstName</span> <span class=\"attr\">...</span>&gt;</span></span><br></pre></td></tr></table></figure>\n\n<p>Now you can use this in your typescript using ViewChild() as explained above, or you can use it in your template as a regular variable.</p>\n<figure class=\"highlight html\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"tag\">&lt;<span class=\"name\">div</span>&gt;</span>&#123; &#123;firstName.value&#125;&#125;<span class=\"tag\">&lt;/<span class=\"name\">div</span>&gt;</span></span><br></pre></td></tr></table></figure>\n\n<h2 id=\"Use-a-Model-Driven-Approach\"><a href=\"#Use-a-Model-Driven-Approach\" class=\"headerlink\" title=\"Use a Model Driven Approach\"></a>Use a Model Driven Approach</h2><p>If you are coming from AngularJS, you may be tempted to use what is commonly referred to as a Template Driven approach. This is approach that relies no “Two-Way” data-binding to update the data in the typescript code to the fields in your template. While this works for a lot of simple apps, you never know when a simple app will turn into a complex app and your Template based approach will quickly become insufficient.</p>\n<p>No, what you want to use is the Model Driven approach. This approach gives you A LOT more control over what we typically are attempting to do in our forms and scales well as the complexity of our forms increases.</p>\n<p>I’ve written a lot more about this in my post on <a href=\"/awesome-angular2-architecture-options-and-opinions/\">Angular2 Architecture</a>.</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>Obviously, there is a lot to learn. If you keep using Angular2 like you’ve been using AngularJS, you are going to run into a lot of difficulties. It pays to learn how a system works prior to using it for a real application.</p>\n<p>What have you learned along the way? Leave a comment.</p>\n",
            "tags": [
                "angular",
                "typescript",
                "DOM"
            ]
        }
    ]
}