{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"strong typing\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/why-insist-on-return-types-in-typescript/",
            "url": "http://davembush.github.com/why-insist-on-return-types-in-typescript/",
            "title": "Why Insist On Return Types In TypeScript?",
            "date_published": "2023-03-25T18:47:38.000Z",
            "content_html": "<p>There are different opinions about whether or not to use return types in TypeScript. I respect that, but I would like to share why I think they are helpful.</p>\n<p>First, let’s acknowledge the reasons why some people prefer not to use return types.</p>\n<span id=\"more\"></span>\n\n<h2 id=\"Reasons-Against\"><a href=\"#Reasons-Against\" class=\"headerlink\" title=\"Reasons Against\"></a>Reasons Against</h2><h3 id=\"Verbosity-and-Redundancy\"><a href=\"#Verbosity-and-Redundancy\" class=\"headerlink\" title=\"Verbosity and Redundancy\"></a>Verbosity and Redundancy</h3><p>They can add verbosity and redundancy to the code, especially if the return type can be easily inferred by the compiler or the reader.</p>\n<p>I understand that adding return types to methods and functions can make the code longer and sometimes repetitive. But I also believe that they can add some benefits that outweigh the costs. We’ll explore those benefits later.</p>\n<h3 id=\"Limiting-Flexibility-and-Reusability\"><a href=\"#Limiting-Flexibility-and-Reusability\" class=\"headerlink\" title=\"Limiting Flexibility and Reusability\"></a>Limiting Flexibility and Reusability</h3><p>They can limit the flexibility and reusability of functions, especially if the return type is too specific or restrictive.</p>\n<p>I agree that we should avoid making our functions too specific or restrictive. But I don’t think that using return types necessarily leads to that. In fact, we can use generics and other TypeScript features to make our functions more flexible and reusable.</p>\n<h3 id=\"Introducing-Errors-and-Inconsistencies\"><a href=\"#Introducing-Errors-and-Inconsistencies\" class=\"headerlink\" title=\"Introducing Errors and Inconsistencies\"></a>Introducing Errors and Inconsistencies</h3><p>They can introduce errors or inconsistencies if the return type does not match the actual implementation or behavior of the function.</p>\n<p>I think this is a rare case, and if it happens, it means that we have a bug in our logic, not because of TypeScript but in spite of it. TypeScript is designed to catch these kinds of errors at compile time, so we can fix them before they cause any trouble.</p>\n<h3 id=\"Sometimes-difficult-or-impossible-to-specify\"><a href=\"#Sometimes-difficult-or-impossible-to-specify\" class=\"headerlink\" title=\"Sometimes difficult or impossible to specify\"></a>Sometimes difficult or impossible to specify</h3><p>They can be difficult or impossible to specify for some functions that throw errors or have multiple return paths.</p>\n<p>I admit that this can be challenging, but not impossible. We can use union types, never types, and other TypeScript tools to specify the return type for any function. If we can’t, then maybe we need to rethink our code design.</p>\n<p>Is the function too big? Doing too much? Maybe we can split it into smaller functions that do one thing and do it well.</p>\n<h2 id=\"Reasons-For\"><a href=\"#Reasons-For\" class=\"headerlink\" title=\"Reasons For\"></a>Reasons For</h2><p>If you haven’t noticed, I’m a fan of using return types in TypeScript. I think they make the code more readable, reliable, and maintainable. Here are some of the reasons why:</p>\n<h3 id=\"Readability-and-Documentation\"><a href=\"#Readability-and-Documentation\" class=\"headerlink\" title=\"Readability and Documentation\"></a>Readability and Documentation</h3><p>They make the code more readable and self-documenting, especially for complex or unfamiliar functions. They also help IDEs and editors to provide better code completion and hints.</p>\n<p>By using return types, we can communicate to ourselves and other developers what a function is supposed to do and what it returns. This can save us time and effort when we need to understand or modify the code. It can also help us avoid mistakes and bugs by using the wrong type of data.</p>\n<h3 id=\"Reliability-and-Robustness\"><a href=\"#Reliability-and-Robustness\" class=\"headerlink\" title=\"Reliability and Robustness\"></a>Reliability and Robustness</h3><p>They make the code more reliable and robust, especially for edge cases and unexpected scenarios. They also help TypeScript to <a href=\"https://www.typescriptlang.org/docs/handbook/type-inference.html\">perform better type inference and type checking</a> and <a href=\"https://github.com/microsoft/TypeScript/wiki/Performance#using-type-annotations\">can improve the compile time performance</a>.</p>\n<p>By using return types, we can ensure that our functions behave consistently and correctly, even when they encounter errors or unexpected inputs. We can also leverage TypeScript’s powerful type system to catch errors at compile time, rather than at runtime. This can prevent crashes and improve performance.</p>\n<p>I recently read of a team who had a system that was largely untyped. Whenever a bug came in, they fixed the bug and then added types to the original code to see if the compiler would catch the bug. It turns out that simply adding types would have caught 15% of the bugs that came in.</p>\n<h3 id=\"Maintainability-and-Scalability\"><a href=\"#Maintainability-and-Scalability\" class=\"headerlink\" title=\"Maintainability and Scalability\"></a>Maintainability and Scalability</h3><p>They make the code more maintainable and scalable, especially for large or complex projects. They also help us to refactor and test our code more easily and confidently.</p>\n<p>By using return types, we can make our code more modular and reusable, avoiding duplication and complexity. We can also refactor and test our code more easily and confidently, knowing that TypeScript will alert us if we break something.</p>\n<h3 id=\"Sorting-our-Code-Into-Libraries\"><a href=\"#Sorting-our-Code-Into-Libraries\" class=\"headerlink\" title=\"Sorting our Code Into Libraries\"></a>Sorting our Code Into Libraries</h3><p>One problem I’ve run into in the past is with a code base that has a lot of typing issues. Along with that the code lived in 400+ libraries that is not very well sorted. I guess you have a similar problem only your code may not be quite so big.</p>\n<p>In order to move the code to a system that allows us to cache our compile results the libs to be buildable. But you can only have buildable libs if none of the libs cause a circular lib reference. To do this, we needed a way to sort the code into appropriate libraries.</p>\n<p>It might have been possible using inferred types, but it is considerably easier if we implicitly type our return values through out the code base.</p>\n<p>Then, using AST, we can easily go through the code and determine what code needs to move and where we should move it to. It still isn’t an easy job, but using return types makes it a lot easier.</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>As you can see, I think that using return types in TypeScript is a good practice that can improve the quality of our code. Of course, there may be exceptions and trade-offs, depending on the context and preferences. But in general, I think that the benefits outweigh the costs.</p>\n<h2 id=\"References\"><a href=\"#References\" class=\"headerlink\" title=\"References\"></a>References</h2><ul>\n<li><a href=\"https://dev.to/arnelenero/why-explicit-return-type-is-a-good-thing-43lj\">Why Explicity Return Type is a Good Thing</a></li>\n<li><a href=\"https://www.reddit.com/r/typescript/comments/ihpnme/opinion_on_explicit_return_types/\">Reddit Thread Where The Majority Support Return Types</a></li>\n<li><a href=\"https://topher.io/writing/make-returns-explicit\">Make Returns Explicit</a></li>\n<li><a href=\"https://sebastiandedeyne.com/when-to-add-types-and-when-to-infer-in-typescript/\">When to Add Types and When to Infer in TypeScript</a></li>\n<li><a href=\"https://www.fun4code.com/typescript-explicit-vs-implicit/\">TypeScript Explicit vs Implicit</a></li>\n<li><a href=\"https://effectivetypescript.com/\">Effective TypeScript (Book)</a></li>\n</ul>\n<p>There are more. While there are people who insist using return types is a bad thing. My research indicates that the overwhelming consensus from the community is that using return types for functions and methods is generally a good thing and that following the default rules of the eslint rule <a href=\"https://github.com/typescript-eslint/typescript-eslint/blob/main/packages/eslint-plugin/docs/rules/explicit-function-return-type.md\">explicit-function-return-types</a> is the proper balance between using return types where they supply value an turning them off where they do not.</p>\n",
            "tags": [
                "typescript",
                "strong typing",
                "linting"
            ]
        }
    ]
}