{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"technical debt\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/technical-debt-is-inevitable/",
            "url": "http://davembush.github.com/technical-debt-is-inevitable/",
            "title": "Technical Debt Is Inevitable",
            "date_published": "2014-10-16T10:00:00.000Z",
            "content_html": "<p>Whoa there Dave.  What are you talking about?  Have you given up the fight? You who have preached the TDD religion.  You who’ve struggled to get organizations to adopt naming conventions, to use version control systems and to use project management software.  The same guy who has implemented continuous integration on his current project?  What’s this world coming to?</p>\n<span id=\"more\"></span>\n\n<p>No. Relax. I haven’t given up.  In fact it is precisely because technical debt is inevitable that we need to implement all of the above.</p>\n<h2 id=\"Danger\"><a href=\"#Danger\" class=\"headerlink\" title=\"Danger\"></a>Danger</h2><p>But there  is a danger in believing that if we were to implement all of the best practices in the book, or that could ever be devised, that technical debt would simply vanish.  And the sooner some of you realize this, the less stressed out you will be.</p>\n<p>You see, no matter how good of a programmer you are today, tomorrow you will be a better programmer.  That is true for all of us.  We are all doing as good of a job as we possibly can today.</p>\n<h2 id=\"A-Story\"><a href=\"#A-Story\" class=\"headerlink\" title=\"A Story\"></a>A Story</h2><p>This reminds me of a story I heard once.</p>\n<p>It seems there was this programmer who had to make a change to some code and, like we all do, the first thing he did was to try to wrap his head around the code he was looking at.  A few minutes into this common exercise, he starts exclaiming:</p>\n<ul>\n<li>Who wrote this code?</li>\n<li>This is the worst code I’ve ever seen.</li>\n<li>The guy who wrote this can’t even really call himself a programmer!</li>\n</ul>\n<p>And then, it got unusually quite in his cubicle.</p>\n<p>His friend in the next cube calls over the wall, “Hey John, you OK?”</p>\n<p>And John responds, “It’s my code.”</p>\n<p>Now, the reason this is a funny story… well, it is a funny story for me anyhow… is because this happens to us all of the time.</p>\n<p>I think I spent the first 5 years of my career looking at code I wrote six months ago and thinking, “What was I thinking when I wrote this?”</p>\n<p>Even today, 26 years in, I have code I wrote six months or more ago that I know I need to rewrite.  The only reason I haven’t yet is because I want to make sure I have a full test harness around it before I tweak it.</p>\n<h2 id=\"Here’s-the-point\"><a href=\"#Here’s-the-point\" class=\"headerlink\" title=\"Here’s the point.\"></a>Here’s the point.</h2><p>We are all getting better at what we do.  What we would do today isn’t what we would have done six months ago.  The person who wrote the code you are looking at was doing the best he could at the time.</p>\n<p>Therefore, we should just plan on code being “wrong.”</p>\n<p>This has two explicit implications to how you relate to your code and your co-workers.</p>\n<h3 id=\"Don’t-be-surprised-by-bad-code\"><a href=\"#Don’t-be-surprised-by-bad-code\" class=\"headerlink\" title=\"Don’t be surprised by bad code\"></a>Don’t be surprised by bad code</h3><p>First, you should not be surprised when you find bad code.  You should instead be shocked when you find well written code.  Since even you write bad code, you should be gracious when you find bad code that isn’t yours.  You don’t want to be the guy in the story  I just told.  You might have done the same thing today if you knew only what the person who wrote the code you are looking at knew at the time the code was written.</p>\n<h3 id=\"You-should-expect-that-your-code-will-be-broken-in-some-way\"><a href=\"#You-should-expect-that-your-code-will-be-broken-in-some-way\" class=\"headerlink\" title=\"You should expect that your code will be broken in some way.\"></a>You should expect that your code will be broken in some way.</h3><p>This has been probably the hardest thing for me to get control of.  I have, historically, been one to deny that my code has a bug.  I’ve taken it as a personal insult, or an assault on my character when someone finds a bug in my code. </p>\n<p>Until recently.</p>\n<p>Once I was able to internalize the fact that the person reporting the bug was not upset, that the only person who expected me to be perfect was me, and that being wrong was part of being human, I was able to calm down a bit.</p>\n<p>You see, none of us are all knowing.  Most of us program for what the code is supposed to do and don’t think about what it shouldn’t do (which is where most of the bugs occur).  The spoken&#x2F;written language is an imprecise communicator, even if you develop a dictionary for your project.  You’ll never get all of your terms defined.  You just don’t know what you don’t know.  And therefore there will be bugs.</p>\n<p>Maybe you’ll think, “I should have known that!”  Well, yes, maybe you SHOULD have.  But the fact is, you didn’t.</p>\n<p>When before I used to deny that the bug could even exist, my reaction now is, “Hmmm, wonder what’s going on there.  OK, well, put it in the issue tracker and I’ll get it fixed.”</p>\n<p>No drama.  No conflict.  No denial.  No blame.  Just deal with the issue.</p>\n<h2 id=\"This-is-what-it-means-to-be-Agile\"><a href=\"#This-is-what-it-means-to-be-Agile\" class=\"headerlink\" title=\"This is what it means to be Agile\"></a>This is what it means to be Agile</h2><p>And you see, this is the beauty of the Agile methodology.  Agile assumes we aren’t going to get it right the first time.  It assumes humans are poor communicators.  It assumes that programmers aren’t going to understand the problem the first time they try to come up with a solution.  It assumes technical debt is inevitable.</p>\n<p>Isn’t it time that you do too? Or am I the only one who has suffered with this problem?</p>\n",
            "tags": [
                "agile",
                "scrum",
                "technical debt"
            ]
        }
    ]
}