{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"qa\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/how-to-establish-peace-to-the-qa-vs-dev-battle/",
            "url": "http://davembush.github.com/how-to-establish-peace-to-the-qa-vs-dev-battle/",
            "title": "How to Establish Peace to the QA vs Dev Battle",
            "date_published": "2016-09-13T10:30:00.000Z",
            "content_html": "<p>Have you ever noticed how, when QA reports a “defect” developers tend to bristle?  I first noticed this in myself a few years ago.  Now that I’m functioning as a Scrum coach, I’m noticing it in others.</p>\n<p>Is there a way to have some kind of quality checking in our code that doesn’t make the whole process feel so adversarial?  I think so.</p>\n<p>I believe there are some adjustments that need to be made organizationally and personally that will bring these two groups together.</p>\n<p>But first, why does this problem exist in the first place? <figure><img src=\"/uploads/2016/09/image.png\" title=\"How to Establish Peace to the QA vs Dev Battle\"><figcaption>Photo credit: <a href=\"//www.flickr.com/photos/39908901@N06/9129574323/\">m01229</a> via <a href=\"//visualhunt.com\">Visual hunt</a> &#x2F; <a href=\"//creativecommons.org/licenses/by/2.0/\">CC BY</a></figcaption></figure></p>\n<span id=\"more\"></span>\n\n<h2 id=\"How-The-Battle-Started\"><a href=\"#How-The-Battle-Started\" class=\"headerlink\" title=\"How The Battle Started\"></a>How The Battle Started</h2><h3 id=\"How-to-Insult-a-Programmer\"><a href=\"#How-to-Insult-a-Programmer\" class=\"headerlink\" title=\"How to Insult a Programmer\"></a>How to Insult a Programmer</h3><p>When I was growing up, my sister was very direct.  If she thought you were ugly, she’d tell you so.  OK.  Maybe it wasn’t quite that bad.  But one day, I remember she said something to the effect of, “I didn’t say anything that wasn’t true.”  And both my mom and I said, “Yes, but it isn’t what you said so much as how you said it.”  In fact, you can say the same words in two entirely different ways.  Two sets of inflections.  And what they mean can change drastically.  Sometimes just changing the words you use can change the meaning.</p>\n<p>But, to a programmer, no matter how you say, “Your code has a bug,” they will probably end up hearing.</p>\n<p>“Your code sucks!” You see.  Programmers really do care about their code.  At least the really good ones do.  And while it may seem very silly, most programmers get offended when you suggest they’ve written buggy code.</p>\n<p>This, you see, is the core of the problem.  Once you understand this, the fix becomes rather obvious.</p>\n<h3 id=\"Don’t-Call-It-a-Bug\"><a href=\"#Don’t-Call-It-a-Bug\" class=\"headerlink\" title=\"Don’t Call It a Bug\"></a>Don’t Call It a Bug</h3><p>I think nothing has done more damage in the field of programming that the fact that we call software problems “Bugs.”  It is such an ugly word.  When is the last time, other than a Pixar movie, when we’ve thought of bugs as something we would want to welcome?  We might as well say, “Hey, I found some shit in this program!” When I got my Scrum certification, our instructor asked a simple revealing question.  “How many of you think people are doing their best to do the right thing?”  That’s not exactly what he asked, but that’s what he meant.  If you believe that all evil in the world is intentional, you’ll come away believing that all programmer intentionally put bugs in their code.  And while I do know of a few cases where this has happened.  Most of us try our best to write perfect code.  When we don’t it is because we didn’t think of the situation and code for it.</p>\n<p>If on the other hand, you think everyone is trying to do their best, why treat defects in software as something evil? To paraphrase Scott Hanselman, “Most people are not nearly smart enough to be as evil as you act like they are.”</p>\n<h3 id=\"Most-Bugs-are-a-Specification-Problem\"><a href=\"#Most-Bugs-are-a-Specification-Problem\" class=\"headerlink\" title=\"Most Bugs are a Specification Problem\"></a>Most Bugs are a Specification Problem</h3><p>Weather you have a formal specification or an informal specification, my observation is that most “Bugs” that show up in code are a result of either 1) the specification being misunderstood or 2) the specification being incomplete.</p>\n<p>Yes, there are a few places where neither of those are true and the programmer clearly missed the mark.  But, even then, assuming they missed the mark rather than assuming the specification was unclear will go a long way in making the programmer more receptive to the fact that the code needs to be changed.  Just the fact that we call a defect in our programs a “Bug” reveals and colors what we think about who’s fault</p>\n<h2 id=\"What-Programmers-Can-Do\"><a href=\"#What-Programmers-Can-Do\" class=\"headerlink\" title=\"What Programmers Can Do\"></a>What Programmers Can Do</h2><h3 id=\"It’s-Not-Personal\"><a href=\"#It’s-Not-Personal\" class=\"headerlink\" title=\"It’s Not Personal\"></a>It’s Not Personal</h3><p>Listen gang.  Bugs are not a reflection of your personal character.  And even if someone thought it was, that doesn’t make it true.  At worse, it means you might have some stuff you still need to learn about how to program well.  OK.  We’ll never be perfect.  Think about this, while you are writing the code, your compiler, or runtime, tells you you’ve done something wrong quite frequently.  But as soon as a human tells you something similar, you take it personally?  That’s pretty wacked.</p>\n<p>Here are a few tips I’ve learned:</p>\n<ul>\n<li>Emotions are learned responses.  This means your negative response to bugs can be retrained.</li>\n<li>Just because someone says something about you, or disapproves of you personally, doesn’t mean they are right.</li>\n<li>Most criticism is only an opinion based on an expectation.</li>\n</ul>\n<p>If you can internalize these, you will be much more receptive to hearing that your code has a flaw.</p>\n<h3 id=\"Break-the-Spec-into-Tasks\"><a href=\"#Break-the-Spec-into-Tasks\" class=\"headerlink\" title=\"Break the Spec into Tasks\"></a>Break the Spec into Tasks</h3><p>One thing I’ve started doing recently that I’ve found to be a great help is that I’ve started breaking the specification I’ve been given down into the composite task that I’ll need to implement the specification.  How granular.  I aim for task that should take less than four hours.  By getting this granular, I’m able to accurately estimate how long it should take me to complete the specification, and I’m sure I’ve caught all of the tasks involved in completing the specification.</p>\n<p>You should track your time against your estimates so you can get a sense of how far off your gut is relative to reality.  This will improve your ability to estimate projects.</p>\n<p>By breaking down the project like this, you are more likely to see holes in the requirements before you even start coding.</p>\n<h3 id=\"Create-a-Test-Plan\"><a href=\"#Create-a-Test-Plan\" class=\"headerlink\" title=\"Create a Test Plan\"></a>Create a Test Plan</h3><p>The other thing I’ve started doing is that I’ve started writing out how I plan to test the specification once I’ve completed it.  I just write this out.  Once again, this helps me find holes in the requirement.  But this also forces me to start thinking of ways someone might use the code that would break it.  And that simple act of trying to break it in my mind prior to coding it, refines the spec, and makes my code more reliable.</p>\n<h3 id=\"Ask-for-a-Review\"><a href=\"#Ask-for-a-Review\" class=\"headerlink\" title=\"Ask for a Review\"></a>Ask for a Review</h3><p>Once you have your tasks and your test plan, ask the person who gave you the spec to review it.  “Does this look like it reflects what you’ve asked me to do?”  This does two things.  First, and most importantly, it ensures you understand what it is you are building.  But, it also enlists someone else in the responsibility of ensuring what you finally build is what should have been built.</p>\n<h2 id=\"What-QA-Can-Do\"><a href=\"#What-QA-Can-Do\" class=\"headerlink\" title=\"What QA Can Do\"></a>What QA Can Do</h2><h3 id=\"Don’t-Call-Them-Bugs\"><a href=\"#Don’t-Call-Them-Bugs\" class=\"headerlink\" title=\"Don’t Call Them Bugs\"></a>Don’t Call Them Bugs</h3><p>I remember reading a Louis L’amour book one where the basic plot was this wagon train going out west.  At the beginning of the trip they had all agreed that no “bad language” was allowed.  And then one day, someone used the word, “shit” to describe cow poop that was on the ground.  The group was in shock and he was reprimanded.  At that point I remember the line, “If a word makes it any different, why don’t we just call it pudding?” But you see, as I’ve already explained, a word DOES make a difference.</p>\n<p>The word I would prefer to use is “Specification Refinement” because, in the end, that is what they are.</p>\n<h3 id=\"Don’t-Write-Requirements\"><a href=\"#Don’t-Write-Requirements\" class=\"headerlink\" title=\"Don’t Write Requirements\"></a>Don’t Write Requirements</h3><p>One thing I’ve noticed happens quite frequently is that once QA has verified all of the items in the requirement, they start doing exploratory testing, as they should.  But, when they find something, they inadvertently start writing requirements.  It looks like this.</p>\n<p>“I did X, Y and Z.  I expected to get result 1 but instead got result 2.” Some of you are probably thinking, “What’s wrong with this?!” Well, why did you EXPECT to get result 1?  If the expectation was not listed in the requirement, you have no valid reason to expect anything.  Your expectation is just your opinion about what should happen based on previous experience.</p>\n<p>So, how to write up this problem instead? “I did X, Y and Z and 2 happened.  This doesn’t look right but I don’t see anything in the spec that says what should happen.”</p>\n<h3 id=\"Don’t-Assign-Bugs\"><a href=\"#Don’t-Assign-Bugs\" class=\"headerlink\" title=\"Don’t Assign Bugs\"></a>Don’t Assign Bugs</h3><p>This one is going to fly in the face of QA teams everywhere.  But remember, we are trying to find peace in what has become an antagonistic relationship.</p>\n<p>Remember how I said that programmers react emotionally to the fact that you found a bug?  Well, if you assign a bug to them and they get a notification about that bug in the middle of writing code for the current sprint, here is what is going to happen.  First, the email is going to interrupt them.  Second, they will have an emotional response to the bug report that could continue to derail them for the rest of the day.</p>\n<p>Instead, you should be assigning the bug to the project.  Assuming you are using Scrum and have a backlog, the issue should be put on the backlog for grooming.  Grooming would include figuring out who is responsible for the bug or who is responsible for finding out what the core issue is so we can assign the bug appropriately.</p>\n<p>One of the problems I’ve seen with assigning bugs to specific developers is that the bug is often assigned incorrectly.</p>\n<p>By assigning the bugs to the back log as specification refinements, they just become additional features and the sting associated with “Bugs” goes away.</p>\n<p>If you are using software that requires you to assign bugs to an individual, make that individual the Scrum Master, Product Owner, or Project Manager (if you aren’t doing Scrum).</p>\n<h2 id=\"Organizational-Changes\"><a href=\"#Organizational-Changes\" class=\"headerlink\" title=\"Organizational Changes\"></a>Organizational Changes</h2><p>Finally, I want to address organizational changes that you may need to make.  Hopefully, you are already doing this.  But my experience tells me otherwise.</p>\n<h3 id=\"Silos-Kill\"><a href=\"#Silos-Kill\" class=\"headerlink\" title=\"Silos Kill\"></a>Silos Kill</h3><p>Everywhere I go, QA is a separate department.  Why can’t QA be co-located with the developers?  Wouldn’t it make a lot more sense to have QA working with the developers to figure out a test plan so we can code for the plan rather than having the plan developed in isolation?  I get that exploratory testing might reveal additional issues, but certainly some of those issues can be revealed early by defining how the code is going to be explored.  Plus, making everyone part of the same team means they are all working toward the same goal.  No one gets offended that way.</p>\n<p>When one QA person found out I was writing unit tests, she asked, “What will be left for me to tests?”  Which I found to be an incredibly naïve way of thinking.  Wouldn’t you hope that you don’t find any problems with the code I am working on?  How is the fact that I’m testing a problem for QA?  Aren’t we all working on the same goal?</p>\n<h3 id=\"Central-Source-of-Truth\"><a href=\"#Central-Source-of-Truth\" class=\"headerlink\" title=\"Central Source of Truth\"></a>Central Source of Truth</h3><p>Another place that needs to be addressed related to silos – Another area that re-enforces and is a result of silos – is this habit of each group using their own project management software.</p>\n<p>In one organization I’ve worked at we used four different systems.  One system for version control (GitHub) another system for QA (HP Quality Center) a third system to manage requirements (which we only used minimally and instead had documents on a shared drive) and a forth system for managing our Kanban board (Jira).</p>\n<p>The frustrating thing is that 80% of what everyone needed to do could have been achieved by using GitHub.  But even if we needed to use separate systems for the actual artifacts, it seems to me that we could use one system for tracking the project instead of having it tracked three or four different ways.  That’s just craziness.</p>\n",
            "tags": [
                "project management",
                "best practices",
                "QA"
            ]
        },
        {
            "id": "http://davembush.github.com/the-proper-function-of-qa/",
            "url": "http://davembush.github.com/the-proper-function-of-qa/",
            "title": "The Proper Function of QA",
            "date_published": "2014-05-01T17:18:00.000Z",
            "content_html": "<p><img src=\"/uploads/2014/04/QA.png\" alt=\"QA\" title=\"QA\"> With all this talk of test driven development, one has to naturally ask, “Where does the QA department fit in?  Do they even have a role in the organization any more?” Well, the answer to that is, “absolutely but probably not the role they think they have.”</p>\n<span id=\"more\"></span>\n\n<h2 id=\"QA-People-Are-Not-Programmers\"><a href=\"#QA-People-Are-Not-Programmers\" class=\"headerlink\" title=\"QA People Are Not Programmers\"></a>QA People Are Not Programmers</h2><p>Once again, as I visit organizations, I find that they are trying to use automated testing tools to script their test.  This ends up being a fool’s errand because most QA people are not programmers and to create a script that is actually going to work reliably, that is going to take a programmer.</p>\n<h2 id=\"Jr-Programmers-Are-Not-QA-People\"><a href=\"#Jr-Programmers-Are-Not-QA-People\" class=\"headerlink\" title=\"Jr Programmers Are Not QA People\"></a>Jr Programmers Are Not QA People</h2><p>The other related problem I frequently see is that organizations tend to put junior programmers in the QA department to handle this “trivial programming task” when what they really ought to be doing is placing senior level programmers in the department because they are more likely to be able to predict what could go wrong.  But I digress.</p>\n<p>By moving to a test driven development process, you actually end up solving the problem of QA needing programmers because you’ve moved the creation of the scripts away from the QA department and back on to the programming staff where it belongs.</p>\n<p>So what is the point of having a QA department if they are no longer going to create test scripts?</p>\n<h2 id=\"The-Proper-Role-of-QA\"><a href=\"#The-Proper-Role-of-QA\" class=\"headerlink\" title=\"The Proper Role of QA\"></a>The Proper Role of QA</h2><p>They have the same function they’ve always had.  Their job is to try to break the program.  To find all of the conditions the programmers left out when they wrote the code and to report those problems back to the programming staff where they can write a test for the problem and fix the bug.</p>\n<p>This may sound like a job that anyone can do, but remember that once they’ve broken the program they have to document how they broke it in a way they can repeat so that when the problem is reported to the programming staff, the error is easy to find.  This requires an attention to detail that few people have.</p>\n",
            "tags": [
                "roles",
                "QA",
                "Quality"
            ]
        }
    ]
}