{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dave's Notebook • All posts by \"302\" tag",
    "description": null,
    "home_page_url": "http://davembush.github.com",
    "items": [
        {
            "id": "http://davembush.github.com/infinite-302-loop-how-would-you-even-know/",
            "url": "http://davembush.github.com/infinite-302-loop-how-would-you-even-know/",
            "title": "Infinite 302 Loop - How would you even know?",
            "date_published": "2009-03-11T11:08:36.000Z",
            "content_html": "<p><img src=\"/uploads/2009/03/trav-053.jpg\" alt=\"trav-053\"> It happens eventually to all web developers.  It’s happened to me twice in the last week.  You make one simple change to your web site and then you can no longer access it.  When you browse to it in IE you get some completely useless “We can’t access the page you are looking for” error.  In FireFox, it at least tells you that you have a “Redirect Loop” and in IE6, if you are fortunate enough to still be writing for that browser, you can see that it is blinking at you as it tries to retrieve the page(s) multiple times.  But how do you know what’s redirecting to what?  For that matter, other than running a browser that told you, how would you even know it was a 302 error?</p>\n<span id=\"more\"></span>\n\n<p>I know I’ve mentioned this before but it’s definitely worth repeating.  Get yourself a copy of <a href=\"//www.telerik.com/fiddler\">Fiddler</a>. </p>\n<p>Fiddler is a proxy that runs on local host.  By default when you run it, it automatically installs itself as a proxy in IE so you really don’t have to know much more than how to install software to get up and running with it. When you access a web site with it, it will tell you everything that is going on.  What headers are being sent.  What headers are coming back from the server.  Files that are being requested.  Status codes that are coming back. Any time I have a client-side problem with my web sites, or any time I have a problem with my web sites that I can’t explain from the server side, I reach for Fiddler.  More often than not, it tells me or at least guides me to what the real problem is.</p>\n<p>For example, last week I was given the task of creating a 301 redirect from one domain to another.  I thought I had the code written correctly to do this, but when we went to access the domain it went into an infinite loop.  Obviously something was wrong, but what?</p>\n<p>When I ran similar code on other domains it worked correctly. When I ran Fiddler, I found that the page was redirecting to itself multiple times.  Odd.  What would make it do that?</p>\n<p>So back to my code, where I quickly discovered that I had left out a character in my replace function so that domain A was never being rewritten to domain B so domain A was constantly redirecting to itself.</p>\n<p>This morning’s error was a little more fun.  My designer was trying to install a module into DotNetNuke last night when the site suddenly “stopped working.” Same deal.  Only this time it is because there is some module that is redirecting from the home page to another page and then that other page is redirecting back to the home page. Again, I would have never been able to track this down if I hadn’t had Fiddler to help me.</p>\n<p>I’ve also used this to verify that javascript tracking codes are working correctly.  If you need to see traffic that is going between the browser and the server, Fiddler is the tool you are looking for.</p>\n",
            "tags": [
                "301",
                "302",
                "fiddler",
                "infinite loop"
            ]
        },
        {
            "id": "http://davembush.github.com/asp-net-response-redirect-and-javascript/",
            "url": "http://davembush.github.com/asp-net-response-redirect-and-javascript/",
            "title": "ASP.NET Response.Redirect() and JavaScript",
            "date_published": "2009-01-28T10:10:10.000Z",
            "content_html": "<p><img src=\"/uploads/2009/01/toco-toucan.jpg\" alt=\"A toucan perched on a branch in Brazil.\"> Yesterday we covered issues surrounding using ASP.NET’s Response.Redirect in server side code. We noted that not handing it correctly could prevent code from running on the server that we want to run. The other issue is emitting Javascript in the server side in association with Response.Redirect(). This also leads to unexpected problems if you aren’t thinking about what is actually happening with your code.  Take this code as an example:</p>\n<span id=\"more\"></span>\n\n<figure class=\"highlight csharp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">    <span class=\"function\"><span class=\"keyword\">protected</span> <span class=\"keyword\">void</span> <span class=\"title\">Page_Load</span>(<span class=\"params\"><span class=\"built_in\">object</span> sender, EventArgs e</span>)</span></span><br><span class=\"line\">    &#123;</span><br><span class=\"line\">        <span class=\"built_in\">string</span> myscript = <span class=\"string\">@&quot;&lt;script language=&#x27;javascript&#x27;&gt;</span></span><br><span class=\"line\"><span class=\"string\">alert(&#x27;hello world&#x27;);</span></span><br><span class=\"line\"><span class=\"string\">&lt;/script&gt;&quot;</span>;</span><br><span class=\"line\">        ClientScript.RegisterClientScriptBlock</span><br><span class=\"line\">            (<span class=\"string\">&quot;&quot;</span>.GetType(), <span class=\"string\">&quot;s&quot;</span>, myscript);</span><br><span class=\"line\">        Response.Redirect(<span class=\"string\">&quot;~/newpage.aspx&quot;</span>,<span class=\"literal\">false</span>);</span><br><span class=\"line\"></span><br><span class=\"line\">    &#125;</span><br></pre></td></tr></table></figure>\n\n<p>The question is, why does the javascript never display “hello world”? Actually, the javascript is typically a little more complicated than “hello world.” But the question is always, “Why didn’t my javascript execute? It works fine without the redirect.” Once again, we need to think more clearly about what we’ve actually written. What we’ve actually told the server to do is the following:</p>\n<ol>\n<li>Render the javascript to display “hello world” in an alert box on the client.</li>\n<li>Set the header (not the header element, but the header that tells the browser whether the code executed successfully or not) to “302 redirect.”</li>\n</ol>\n<p>When the browser finally gets the stream back from the server, it will actually see step 2 first because the header comes before the javascript code. The browser will look at that 302, ignore everything else on the page, and faithfully redirect to the page specified as part of the 302.</p>\n",
            "tags": [
                "javascript",
                "asp.net",
                "302",
                "redirect",
                "response"
            ]
        }
    ]
}